{
  "common": {
    "name": "discord",
    "version": "2.3.1",
    "news": {
      "2.3.1": {
        "en": "Fixed Blockly for the latest JavaScript adapter changes\nUpdated dependencies",
        "de": "Blockly für die neuesten Änderungen vom JavaScript Adapter repariert\nAbhängigkeiten Aktualisiert",
        "ru": "Fixed Blockly для последних изменений адаптера JavaScript\nОбновленные зависимости",
        "pt": "Fixo Blockly para as mudanças mais recentes do adaptador JavaScript\nDependências atualizadas",
        "nl": "Vast Blockly voor de nieuwste wijzigingen van JavaScript-adapter\nBijgewerkte afhankelijkheden",
        "fr": "Correction Blockly pour les dernières modifications de l'adaptateur JavaScript\nDépendances actualisées",
        "it": "Bloccato per le ultime modifiche dell'adattatore JavaScript\nDipendenze aggiornate",
        "es": "Bloqueo fijo para los últimos cambios de adaptador JavaScript\nDependencias actualizadas",
        "pl": "Naprawiono blokowanie dla najnowszych zmian adaptera JavaScript\nAktualizacja zależności",
        "uk": "Виправлено Blockly для останніх змін адаптера JavaScript\nОновлені залежності",
        "zh-cn": "JavaScript 最新适配器更改的固定块\n更新的依赖关系"
      },
      "2.3.0": {
        "en": "💥 Node.js 18+ is now required!\nAdded support for custom bot activities\nFixed Issue with embed colors not accepting hex color codes\nFixed user activities for users with custom activities (see [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nUpdated dependencies",
        "de": "💥 Node.js 18+ ist jetzt erforderlich!\nUnterstützung für benutzerdefinierte Bot-Aktivitäten hinzugefügt\nFehler behoben, dass Einbettungen keine Hex-Farbwerte akzeptiert haben\nFehler bei benutzerdefinierten Aktivitäten behoben (siehe [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nAbhängigkeiten aktualisiert",
        "ru": "💥 Node.js 18+ теперь требуется!\nДобавлена поддержка пользовательских действий бота\nФиксированный выпуск с встроенными цветами, не принимая коды цвета гекса\nFixed user activities for users with custom activities (see [#60] (https://github.com/crycode-de/ioBroker.discord/issues/60)\nОбновленные зависимости",
        "pt": "! Node.js 18+ é agora necessário!\nAdicionado suporte para atividades de bot personalizadas\nCorrigido Problema com cores embutidas não aceitando códigos de cores hexagonais\nAtividades fixas para usuários com atividades personalizadas (ver [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))))\nDependências atualizadas",
        "nl": "Node.js 18+ is nu nodig!\nExtra ondersteuning voor aangepaste botactiviteiten\nFixed Issue met ingebedde kleuren die geen hex kleurcodes accepteren\nVaste gebruikersactiviteiten voor gebruikers met aangepaste activiteiten (zie [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nBijgewerkte afhankelijkheden",
        "fr": "Le Node.js 18+ est maintenant requis!\nAjout d'un support pour les activités bot personnalisées\nProblème corrigé avec les couleurs d'intégration n'acceptant pas les codes de couleur hexagonale\nActivités d'utilisateurs fixes pour les utilisateurs ayant des activités personnalisées (voir [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nDépendances actualisées",
        "it": "💥 Node.js 18+ è ora richiesto!\nAggiunto supporto per attività bot personalizzate\nProblema fisso con colori incorporati non accettare codici colore esagonale\nAttività utente fissa per gli utenti con attività personalizzate (vedere [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nDipendenze aggiornate",
        "es": "💥 Node.js 18+ se requiere ahora!\nApoyo añadido para actividades de bot personalizado\nEdición fija con colores incrustados que no aceptan códigos de color hex\nActividades de usuario fijas para usuarios con actividades personalizadas (véase [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nDependencias actualizadas",
        "pl": "XionNode.js 18 + jest teraz wymagane!\nDodano wsparcie dla niestandardowych działań bot\nNaprawiono wydanie z osadzonymi kolorami, które nie akceptują kodów kolorów szesnastkowych\nDziałalność użytkowników stałych dla użytkowników prowadzących działalność na własny rachunek (zob. [# 60] (https: / / github.com / crycode- de / ioBroker.discord / issues / 60))\nAktualizacja zależności",
        "uk": "浜у 涓 蹇!\nДодано підтримку користувацьких ботів\nВиправлено проблему з рельєфними кольорами, не приймається кольорові коди шестигранного кольору\nВиправлено роботу користувача для користувачів з індивідуальною діяльністю (див. [#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\nОновлені залежності",
        "zh-cn": "现在需要18+节点!\n为自定义机器人活动添加支持\n嵌入颜色的固定问题, 不接受十六进制颜色代码\n有自定义活动的用户的固定用户活动(见[#60](https://github.com/crycode-de/ioBroker.discord/issues/60))\n更新的依赖关系"
      },
      "2.2.1": {
        "en": "Fixed blockly target detection if user is provided by a variable (You may need to move a block to update the generated code)\nUpdated dependencies",
        "de": "Fehler in Blockly bei der Erkennung des Ziel behoben, wenn der Benutzer durch eine Variable definiert wird. Es muss ein Block bewegt werden, um den generierten Code zu aktualisieren)\nAbhängigkeiten Aktualisiert",
        "ru": "Исправленное блокирование обнаружения цели, если пользователь предоставляется переменной (может потребоваться переместить блок для обновления сгенерированного кода)\nОбновленные зависимости",
        "pt": "Detecção de alvo bloqueada fixa se o usuário for fornecido por uma variável (Você pode precisar mover um bloco para atualizar o código gerado)\nDependências atualizadas",
        "nl": "Fixed blockly doel detectie als de gebruiker wordt geleverd door een variabele (U moet mogelijk een blok verplaatsen om de gegenereerde code te updaten)\nBijgewerkte afhankelijkheden",
        "fr": "Correction de la détection de cibles de blocage si l'utilisateur est fourni par une variable (Vous pourriez avoir besoin de déplacer un bloc pour mettre à jour le code généré)\nDépendances actualisées",
        "it": "Risolto rilevamento di destinazione bloccata se l'utente è fornito da una variabile (potrebbe essere necessario spostare un blocco per aggiornare il codice generato)\nDipendenze aggiornate",
        "es": "Detección de objetivos fijos si el usuario es proporcionado por una variable (Es posible que necesite mover un bloque para actualizar el código generado)\nDependencias actualizadas",
        "pl": "Naprawiono blokowane wykrywanie celów, jeśli użytkownik jest dostarczany przez zmienną (Być może trzeba przenieść blok, aby zaktualizować wygenerowany kod)\nAktualizacja zależności",
        "uk": "Виправлено помилку, якщо користувач надана змінною (Ви можете перемістити блок для оновлення генерованого коду)\nОновлені залежності",
        "zh-cn": "如果用户由变量提供, 则固定块目标检测( 您可能需要移动一个块来更新生成的代码)\n更新的依赖关系"
      },
      "2.2.0": {
        "en": "Optimized error handling - Network related errors should now be handled completely without adapter restarts and better logging\nFixed small issues in config UI\nUpdated dependencies",
        "de": "Optimierte Fehlerbehandlung - Netzwerkfehler sollten jetzt vollständig ohne Adapter-Neustart behandelt und besser protokolliert werden\nKleine Probleme in der Config-UI behoben\nAbhängigkeiten aktualisiert",
        "ru": "Оптимизированная обработка ошибок - Сетевые связанные ошибки теперь должны быть обработаны полностью без перезагрузок адаптеров и лучшего входа\nИсправлены небольшие проблемы в config UI\nОбновленные зависимости",
        "pt": "Manuseio de erro otimizado - Os erros relacionados à rede agora devem ser tratados completamente sem reinicializações do adaptador e melhor registro\nCorrigido pequenos problemas em UI de configuração\nDependências atualizadas",
        "nl": "Geoptimiseerde fouten, netwerk gerelateerde fouten, moeten nu volledig afgehandeld worden zonder adapterresten en beter vegen\nKleine kwesties opgelost in UI\nVerouderde afhankelijkheid",
        "fr": "Manipulation optimisée des erreurs - Les erreurs liées au réseau devraient maintenant être gérées complètement sans redémarrage d'adaptateur et une meilleure connexion\nCorrection de petits problèmes dans config UI\nMise à jour des dépendances",
        "it": "Gestione degli errori ottimizzata - Gli errori relativi alla rete dovrebbero essere gestiti completamente senza riavviamento dell'adattatore e migliore registrazione\nRisolto piccoli problemi in configurazione UI\nDipendenze aggiornate",
        "es": "Tratamiento optimizado de errores - Los errores relacionados con la red ahora deben manejarse completamente sin reiniciar el adaptador y mejor registro\nProblemas fijos pequeños en config UI\nDependencias actualizadas",
        "pl": "Optymizowana obsługa błędów (ang. Optimized error handling) – błędy związane z siecią powinny być obecnie przejmowane bez ponownego uruchomienia i lepszego logowania\nDrobne problemy w konfiguście\nZależność od upoważnienia",
        "uk": "Оптимізоване поводження з похибками - Пов'язані помилки мережі повинні бути повністю оброблятися без перезавантаження адаптера і краще завантажувати\nВиправлено маленькі питання в конфігурації UI\nОновлені залежності",
        "zh-cn": "减少错误处理——网络相关的错误现在应该完全处理,而不适应其他艺术和更好的伐木。\n混凝土的小问题\nA. 最新依赖情况"
      },
      "2.1.2": {
        "en": "Fixed response to notification-manager adapter",
        "de": "Antwort auf Benachrichtigungen vom notification-manager Adapter korrigiert",
        "ru": "Исправлена реакция на адаптер для уведомлений-менеджера",
        "pt": "Resposta fixa ao adaptador do gerenciador de notificações",
        "nl": "Reactie van de manager",
        "fr": "Réponse fixe à l'adaptateur notification-manager",
        "it": "Risposta fissa all'adattatore di notifica-manager",
        "es": "Respuesta fija al adaptador de gestión de notificaciones",
        "pl": "Fixed response to powiadomienia-managera",
        "uk": "Виправлено відповідь на повідомлення-менеджер адаптера",
        "zh-cn": "对通知-manager的适应反应"
      },
      "2.1.1": {
        "en": "Updated dependencies\nUpdated translations",
        "de": "Abhängigkeiten aktualisiert\nÜbersetzungen aktualisiert",
        "ru": "Обновленные зависимости\nОбновленные переводы",
        "pt": "Dependências atualizadas\nTraduções atualizadas",
        "nl": "Verouderde afhankelijkheid\nVertaling:",
        "fr": "Mise à jour des dépendances\nTraductions actualisées",
        "it": "Dipendenze aggiornate\nTraduzioni aggiornate",
        "es": "Dependencias actualizadas\nTraducciones actualizadas",
        "pl": "Zależność od upoważnienia\nTłumaczenia poprawione",
        "uk": "Оновлені залежності\nОновлені переклади",
        "zh-cn": "A. 最新依赖情况\n最新翻译"
      },
      "2.1.0": {
        "en": "Added support for unique user names\nDetect possible DNS errors during login to prevent restart loops\nBetter handling for login errors, first 4 errors are now logged just as info",
        "de": "Unterstützung für einzigartige Benutzernamen hinzugefügt\nErkennung möglicher DNS-Fehler während des Logins, um Neustartschleifen zu verhindern\nBessere Handhabung für Login-Fehler, die ersten 4 Fehler werden jetzt lediglich als Info geloggt",
        "ru": "Добавлена поддержка уникальных имен пользователей\nОпределите возможные ошибки DNS во время входа, чтобы предотвратить перезагрузочные циклы\nУлучшение обработки для ошибок входа, первые 4 ошибки теперь вошли как info",
        "pt": "Adicionado suporte para nomes de usuário únicos\nDetectar possíveis erros de DNS durante o login para evitar loops de reinício\nMelhor manuseio para erros de login, os primeiros 4 erros agora são registrados como informações",
        "nl": "Vermeld ondersteuning voor unieke gebruikersnamen\nVernietig mogelijke DNS fouten tijdens de login om herstarten te voorkomen\nBeter omgaan met loginfouten, de eerste vier fouten zijn nu net als info",
        "fr": "Support ajouté pour les noms d'utilisateurs uniques\nDétecter d'éventuelles erreurs DNS lors de la connexion pour éviter les boucles de redémarrage\nMeilleure manipulation des erreurs de connexion, les 4 premières erreurs sont maintenant enregistrées comme info",
        "it": "Aggiunto supporto per nomi utente unici\nRileva possibili errori DNS durante il login per prevenire i loop di riavvio\nMigliore gestione degli errori di login, i primi 4 errori sono ora registrati come info",
        "es": "Soporte añadido para nombres de usuario únicos\nDetectar posibles errores de DNS durante el inicio de sesión para evitar bucles de reinicio\nMejor manejo para errores de inicio de sesión, los primeros 4 errores ahora se registran como información",
        "pl": "Wsparcie dla unikalnych użytkowników nazw\nUmożliwia to błędy DNS podczas loginu, aby zapobiec zmianie pętli\nLepiejsza obsługa błędów loginowych, pierwsze 4 błędy są odczytane jako infoin",
        "uk": "Додано підтримку унікальних імен користувачів\nВизначити можливі помилки DNS під час входу, щоб запобігти перезавантаження петель\nНайкраща робота для помилок логіну, перші 4 помилки тепер записуються лише за інформацією",
        "zh-cn": "增加对独特的用户名称的支持\nB. 在伐木期间可能出现DROP的错误,以防止重新开工。\n更妥善地处理伐木错误,目前有4个错误被认定为泡沫。"
      }
    },
    "titleLang": {
      "en": "Discord",
      "de": "Discord",
      "ru": "Discord",
      "pt": "Discord",
      "nl": "Discord",
      "fr": "Discord",
      "it": "Discord",
      "es": "Discord",
      "pl": "Discord",
      "uk": "Розбрат",
      "zh-cn": "Discord"
    },
    "desc": {
      "en": "Discord bot integration",
      "de": "Discord-Bot Integration",
      "ru": "Интеграция с дискорд-ботом",
      "pt": "Integração de bot do Discord",
      "nl": "Discord bot-integratie",
      "fr": "Intégration du robot Discord",
      "it": "Integrazione del bot Discord",
      "es": "Integración de bots de discordia",
      "pl": "Integracja z botem Discord",
      "uk": "Інтеграція бота Discord",
      "zh-cn": "Discord 机器人集成"
    },
    "authors": [
      "Peter Müller <peter@crycode.de>"
    ],
    "keywords": [
      "bot",
      "discord",
      "message",
      "notification"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "tier": 2,
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "discord.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/crycode-de/ioBroker.discord/main/admin/discord.png",
    "readme": "https://github.com/crycode-de/ioBroker.discord/blob/main/README.md",
    "docs": {
      "en": "docs/en/README.md",
      "de": "docs/de/README.md"
    },
    "loglevel": "info",
    "mode": "daemon",
    "type": "messaging",
    "blockly": true,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "push",
    "adminUI": {
      "custom": "json",
      "config": "json"
    },
    "messagebox": true,
    "supportedMessages": {
      "custom": true,
      "notifications": true
    },
    "supportCustoms": true,
    "plugins": {
      "sentry": {
        "dsn": "https://6ee57be76f2d4df2b592e3dbee37fb89@sentry.cryhost.de/8"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=4.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.3.0"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "Activity types and channel types are now in title case. Example: PLAYING is now Playing, GUILD_TEXT is now GuildText. In raw states all type field values are now numbers representing the internal enum values of the types. Please make sure to check and update your usages of the types after upgrading to version 2.0.0 or newer.",
          "de": "Aktivitätstypen und Kanaltypen sind nun in TitleCase. Beispiel: PLAYING ist jetzt Playing, GUILD_TEXT ist jetzt GuildText. In Rohzuständen sind nun alle type-Werte Zahlen, die den internen Enum-Werten der Typen entsprechen. Bitte darauf achten, die Verwenung von Typ-Werten nach dem Upgrade auf Version 2.0.0 oder neuer zu überprüfen und ggf. zu aktualisieren.",
          "ru": "Типы деятельности и типы каналов теперь в случае заголовка. Пример: PLAYING сейчас Playing, GUILD_TEXT теперь GuildText. В сырых состояниях все значения поля типа теперь цифры, представляющие внутренние значения enum типов. Пожалуйста, убедитесь, что проверить и обновить использование типов после обновления до версии 2.0.0 или новее.",
          "pt": "Tipos de atividade e tipos de canal estão agora no caso do título. Exemplo: PLAYING is now Playing, GUILD_TEXT is now GuildText. Em estados crus, todos os valores de campo do tipo são agora números que representam os valores enum internos dos tipos. Certifique-se de verificar e atualizar seus usos dos tipos após atualizar para a versão 2.0.0 ou mais recente.",
          "nl": "Activiteitstypes en kanaaltypes zijn nu in de zaak. PLAYING is nu Playing, GUILDTEXT is nu GuildText. In rauwe staten zijn alle veldwaarden nu cijfers die de interne waarden van de types vertegenwoordigen. Controleer alsjeblieft en update je gebruik van de types na het upgraden naar versie 2.0 of nieuwer.",
          "fr": "Les types d'activité et les types de canal sont maintenant dans le cas de titre. Exemple: PLAYING est maintenant Playing, GUILD_TEXT est maintenant GuildText. Dans les états bruts, toutes les valeurs de champ de type sont maintenant des nombres représentant les valeurs internes des types. Assurez-vous de vérifier et de mettre à jour vos utilisations des types après la mise à niveau de la version 2.0.0 ou plus récente.",
          "it": "I tipi di attività e i tipi di canale sono ora in caso di titolo. Esempio: PLAYING ora sta Playing, GUILD_TEXT è ora GuildText. In stati grezzi tutti i valori di campo di tipo sono ora numeri che rappresentano i valori enum interni dei tipi. Assicuratevi di controllare e aggiornare i vostri usi dei tipi dopo l'aggiornamento alla versione 2.0.0 o più recente.",
          "es": "Tipos de actividad y tipos de canal están ahora en caso de título. Ejemplo: PLAYING es ahora Playing, GUILD_TEXT es ahora GuildText. En estados brutos todos los valores de campo de tipo son ahora números que representan los valores internos de enum de los tipos. Asegúrese de comprobar y actualizar sus usos de los tipos después de actualizar a la versión 2.0.0 o más reciente.",
          "pl": "Wartość typów i typów kanałów jest obecnie w przypadku tytułowego. Przykład: PLAYING jest obecnie Playing, GUILD_TEXT jest obecnie GuildText. W surowych stanach wszystkie wartości pola są teraz numerami reprezentującymi wartości wewnętrzne typów. Zaświadczasz sobie, że sprawdzać i aktualizuje swoje typy po modernizacji do wersji 2.0.0 lub nowszego.",
          "uk": "Типи та типи каналів тепер у назвному випадку. Приклад: PLAYING тепер Playing, GUILD_TEXT тепер GuildText. У сирих штатах всі значення поля типу тепер є числа, що представляють внутрішні значення енму типів. Будь ласка, переконайтеся, що перевірити і оновити ваші використання типів після оновлення версії 2.0.0 або новачка.",
          "zh-cn": "活动类型和渠道类型现处于所有权情况。 例:现在正在推展,古ILD_TEXT现为GuildText。 在原材料中,所有类型的外地价值现在都代表了这些类型的内部价值。 请确保在升级至2.0.0或新版之后检查和更新这些类型。."
        },
        "link": "https://github.com/crycode-de/ioBroker.discord#changelog",
        "level": "warn",
        "linkText": {
          "en": "Changelog",
          "de": "Änderungsprotokoll",
          "ru": "Список изменений",
          "pt": "Registro de alterações",
          "nl": "Wijzigingslog",
          "fr": "Journal des modifications",
          "it": "Registro delle modifiche",
          "es": "registro de cambios",
          "pl": "Dziennik zmian",
          "zh-cn": "变更日志",
          "uk": "Журнал змін"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "protectedNative": [
    "token"
  ],
  "encryptedNative": [
    "token"
  ],
  "native": {
    "token": "",
    "botName": "",
    "processAllMessagesInServerChannel": false,
    "reactOnMentions": true,
    "reactOnMentionsEmoji": "👍",
    "text2commandInstance": "",
    "text2commandRespondWith": "reply",
    "dynamicServerUpdates": true,
    "observeUserPresence": false,
    "observeUserVoiceState": false,
    "enableRawStates": false,
    "enableAuthorization": true,
    "authorizedUsers": [],
    "authorizedServerRoles": [],
    "processMessagesFromUnauthorizedUsers": false,
    "enableCommands": false,
    "commandsGlobal": false,
    "commandRepliesEphemeral": false,
    "cmdGetStateName": "",
    "cmdSetStateName": "",
    "enableCustomCommands": false,
    "customCommands": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": {
          "en": "Information",
          "de": "Informationen",
          "ru": "Информация",
          "pt": "Em formação",
          "nl": "Informatie",
          "fr": "Information",
          "it": "Informazione",
          "es": "Información",
          "pl": "Informacja",
          "uk": "Інформація",
          "zh-cn": "信息"
        }
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": {
          "en": "Connected to discord",
          "de": "Verbunden mit Discord",
          "ru": "Подключен к дискорду",
          "pt": "Conectado à discórdia",
          "nl": "Verbonden met onenigheid",
          "fr": "Connecté à la discorde",
          "it": "Collegato alla discordia",
          "es": "Conectado a la discordia",
          "pl": "Połączony z niezgodą",
          "uk": "З'єднатися до дискорду",
          "zh-cn": "连接到不和谐"
        },
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "bot",
      "type": "channel",
      "common": {
        "name": {
          "en": "Bot",
          "de": "Bot",
          "ru": "Бот",
          "pt": "Robô",
          "nl": "Bot",
          "fr": "Robot",
          "it": "Bot",
          "es": "Bot",
          "pl": "Nerw",
          "uk": "Бодибилдерши",
          "zh-cn": "机器人"
        }
      },
      "native": {}
    },
    {
      "_id": "bot.status",
      "type": "state",
      "common": {
        "name": {
          "en": "Presence status",
          "de": "Anwesenheitsstatus",
          "ru": "Состояние присутствия",
          "pt": "Status de presença",
          "nl": "Aanwezigheidsstatus",
          "fr": "Statut de présence",
          "it": "Stato di presenza",
          "es": "Estado de presencia",
          "pl": "Status obecności",
          "uk": "Статус на сервери",
          "zh-cn": "存在状态"
        },
        "type": "string",
        "role": "text",
        "read": true,
        "write": true,
        "def": "online",
        "states": {
          "online": "online",
          "idle": "idle",
          "dnd": "dnd",
          "invisible": "invisible"
        }
      },
      "native": {}
    },
    {
      "_id": "bot.activityType",
      "type": "state",
      "common": {
        "name": {
          "en": "Activity type",
          "de": "Aktivitätstyp",
          "ru": "Тип деятельности",
          "pt": "Tipo de atividade",
          "nl": "Activiteitstype",
          "fr": "Type d'activité",
          "it": "Tipo di attività",
          "es": "Tipo de actividad",
          "pl": "Rodzaj aktywności",
          "uk": "Тип діяльності",
          "zh-cn": "活动类型"
        },
        "type": "string",
        "role": "text",
        "read": true,
        "write": true,
        "def": "Competing",
        "states": {
          "": "---",
          "Playing": "playing",
          "Streaming": "streaming",
          "Listening": "listening",
          "Watching": "watching",
          "Competing": "competing",
          "Custom": "custom"
        }
      },
      "native": {}
    },
    {
      "_id": "bot.activityName",
      "type": "state",
      "common": {
        "name": {
          "en": "Activity name",
          "de": "Aktivitätsname",
          "ru": "Название деятельности",
          "pt": "Nome da atividade",
          "nl": "Naam activiteit",
          "fr": "Nom de l'activité",
          "it": "Nome dell'attività",
          "es": "Nombre de la actividad",
          "pl": "Nazwa działania",
          "uk": "Назва діяльності",
          "zh-cn": "活动名称"
        },
        "type": "string",
        "role": "text",
        "read": true,
        "write": true,
        "def": "ioBroker"
      },
      "native": {}
    },
    {
      "_id": "servers",
      "type": "channel",
      "common": {
        "name": {
          "en": "Servers",
          "de": "Server",
          "ru": "Серверы",
          "pt": "Servidores",
          "nl": "Servers",
          "fr": "Les serveurs",
          "it": "Server",
          "es": "Servidores",
          "pl": "Serwery",
          "uk": "Статус на сервери",
          "zh-cn": "服务器"
        }
      },
      "native": {}
    },
    {
      "_id": "users",
      "type": "channel",
      "common": {
        "name": {
          "en": "Users",
          "de": "Benutzer",
          "ru": "Пользователи",
          "pt": "Comercial",
          "nl": "Gebruikers",
          "fr": "Utilisateurs",
          "it": "Utenti",
          "es": "Usuarios",
          "pl": "Użytkownicy",
          "uk": "Користувачі",
          "zh-cn": "用户"
        }
      },
      "native": {}
    }
  ]
}
