{
  "common": {
    "name": "discord",
    "version": "2.1.1",
    "news": {
      "2.1.1": {
        "en": "Updated dependencies\nUpdated translations",
        "de": "Abhängigkeiten aktualisiert\nÜbersetzungen aktualisiert",
        "ru": "Обновленные зависимости\nОбновленные переводы",
        "pt": "Dependências atualizadas\nTraduções atualizadas",
        "nl": "Verouderde afhankelijkheid\nVertaling:",
        "fr": "Mise à jour des dépendances\nTraductions actualisées",
        "it": "Dipendenze aggiornate\nTraduzioni aggiornate",
        "es": "Dependencias actualizadas\nTraducciones actualizadas",
        "pl": "Zależność od upoważnienia\nTłumaczenia poprawione",
        "uk": "Оновлені залежності\nОновлені переклади",
        "zh-cn": "A. 最新依赖情况\n最新翻译"
      },
      "2.1.0": {
        "en": "Added support for unique user names\nDetect possible DNS errors during login to prevent restart loops\nBetter handling for login errors, first 4 errors are now logged just as info",
        "de": "Unterstützung für einzigartige Benutzernamen hinzugefügt\nErkennung möglicher DNS-Fehler während des Logins, um Neustartschleifen zu verhindern\nBessere Handhabung für Login-Fehler, die ersten 4 Fehler werden jetzt lediglich als Info geloggt",
        "ru": "Добавлена поддержка уникальных имен пользователей\nОпределите возможные ошибки DNS во время входа, чтобы предотвратить перезагрузочные циклы\nУлучшение обработки для ошибок входа, первые 4 ошибки теперь вошли как info",
        "pt": "Adicionado suporte para nomes de usuário únicos\nDetectar possíveis erros de DNS durante o login para evitar loops de reinício\nMelhor manuseio para erros de login, os primeiros 4 erros agora são registrados como informações",
        "nl": "Vermeld ondersteuning voor unieke gebruikersnamen\nVernietig mogelijke DNS fouten tijdens de login om herstarten te voorkomen\nBeter omgaan met loginfouten, de eerste vier fouten zijn nu net als info",
        "fr": "Support ajouté pour les noms d'utilisateurs uniques\nDétecter d'éventuelles erreurs DNS lors de la connexion pour éviter les boucles de redémarrage\nMeilleure manipulation des erreurs de connexion, les 4 premières erreurs sont maintenant enregistrées comme info",
        "it": "Aggiunto supporto per nomi utente unici\nRileva possibili errori DNS durante il login per prevenire i loop di riavvio\nMigliore gestione degli errori di login, i primi 4 errori sono ora registrati come info",
        "es": "Soporte añadido para nombres de usuario únicos\nDetectar posibles errores de DNS durante el inicio de sesión para evitar bucles de reinicio\nMejor manejo para errores de inicio de sesión, los primeros 4 errores ahora se registran como información",
        "pl": "Wsparcie dla unikalnych użytkowników nazw\nUmożliwia to błędy DNS podczas loginu, aby zapobiec zmianie pętli\nLepiejsza obsługa błędów loginowych, pierwsze 4 błędy są odczytane jako infoin",
        "uk": "Додано підтримку унікальних імен користувачів\nВизначити можливі помилки DNS під час входу, щоб запобігти перезавантаження петель\nНайкраща робота для помилок логіну, перші 4 помилки тепер записуються лише за інформацією",
        "zh-cn": "增加对独特的用户名称的支持\nB. 在伐木期间可能出现DROP的错误,以防止重新开工。\n更妥善地处理伐木错误,目前有4个错误被认定为泡沫。"
      },
      "2.0.0": {
        "en": "Updated discord.js to v14\n💥 Breaking: Activity types and channel types are now in title case. Example: `PLAYING` is now `Playing`, `GUILD_TEXT` is now `GuildText`.\n💥 Breaking: In raw states all `type` field values are now numbers representing the internal enum values of the types.\nAdd support for messages from the notification-manager adapter\nUpdated dependencies\nAdded Ukrainian translations\nUpdated translations",
        "de": "Zugrundeliegende discord.js Bibliothek auf v14 aktualisiert\n💥 Achtung: Aktivitätstypen und Kanaltypen sind nun im TitleCase. Beispiel: PLAYING ist jetzt Playing, GUILD_TEXT ist jetzt GuildText.\n💥 Achtung: In Rohzuständen sind nun alle type-Werte Zahlen, die den internen Enum-Werten der Typen entsprechen.\nUnterstützung für Nachrichten aus dem Benachrichtigungsmanager-Adapter hinzugefügt\nAbhängigkeiten aktualisiert\nUkrainische Übersetzungen hinzugefügt\nAktualisierte Übersetzungen",
        "ru": "Обновлено discord.js в v14\n💥 Перерыв: Типы деятельности и типы каналов теперь в случае заголовка. Пример: PLAYING сейчас Playing, GUILD_TEXT теперь GuildText.\n💥 Перерыв: В сырых состояниях все значения поля типа теперь являются цифрами, представляющими внутренние enum значения типов.\nДобавить поддержку сообщений от адаптера уведомлений-менеджера\nОбновленные зависимости\nДобавлены украинские переводы\nОбновленные переводы",
        "pt": "Atualizado discórdia.js para v14\n💥 Quebrando: Tipos de atividade e tipos de canal estão agora no caso do título. Exemplo: PLAYING is now Playing, GUILD_TEXT is now GuildText.\n💥 Quebrando: Em estados crus, todos os valores de campo do tipo são agora números que representam os valores enum internos dos tipos.\nAdicionar suporte para mensagens do adaptador de gerenciamento de notificações\nDependências atualizadas\nAdicionado traduções ucranianas\nTraduções atualizadas",
        "nl": "Verouderde discord\n_ Breaking: Activiteitstypes en kanaaltypes zijn nu in de zaak. Spelen is nu spelen, GUILDTEXT is nu GuildText.\n_ Breaking: In rauwe staten zijn alle veldwaarden nu cijfers die de interne waarden van de types vertegenwoordigen.\nSteunen voor berichten van de adapter\nVerouderde afhankelijkheid\nVertaling:\nVertaling:",
        "fr": "Actualisé discord.js to v14\n. Breaking: Les types d'activité et les types de canal sont maintenant dans le cas de titre. Exemple: PLAYING est maintenant Jouer, GUILD_TEXT est maintenant GuildText.\n. Breaking: Dans les états bruts, toutes les valeurs de champ de type sont maintenant des nombres représentant les valeurs internes des types.\nAjouter le support pour les messages de l'adaptateur notification-manager\nMise à jour des dépendances\nAjout de traductions ukrainiennes\nTraductions actualisées",
        "it": "Discord.js aggiornato a v14\n💥 Breaking: I tipi di attività e i tipi di canale sono ora in caso di titolo. Esempio: PLAYING ora sta giocando, GUILD_TEXT è ora GuildText.\n💥 Breaking: In stati grezzi tutti i valori di campo di tipo sono ora numeri che rappresentano i valori enum interni dei tipi.\nAggiungi supporto per i messaggi dall'adattatore di notifica-manager\nDipendenze aggiornate\nAggiunto traduzioni ucraino\nTraduzioni aggiornate",
        "es": "Discord.js actualizados a v14\n💥 Romper: Tipos de actividad y tipos de canal están ahora en caso de título. Ejemplo: El juego ahora está jugando, GUILD_TEXT es ahora GuildText.\n💥 Romper: En estados brutos todos los valores de campo de tipo son ahora números que representan los valores internos de enum de los tipos.\nAñadir soporte para mensajes del adaptador de gestión de notificación\nDependencias actualizadas\nTraducciones ucranianas agregadas\nTraducciones actualizadas",
        "pl": "Zmniejszenie rozporządzenia do v14\nżyczenie Breaking: Wartość typów i typów kanałów jest obecnie w przypadku tytułowego. Przykład: PLAYING jest obecnie Playing, GUILD_TEXT jest obecnie GuildText.\nżyczenie Breaking: W surowych stanach wszystkie wartości pola są teraz numerami reprezentującymi wartości wewnętrzne typów.\nAddd support for the message of the notification-manager adapter\nZależność od upoważnienia\nTłumaczenie ukraińskie\nTłumaczenia poprawione",
        "uk": "Оновлено discord.js до v14\nй Перерва: Типи та типи каналів тепер у назвному випадку. Приклад: PLAYING тепер грає, GUILD_TEXT тепер GuildText.\nй Перерва: У сирих штатах всі значення поля типу тепер є числа, що представляють внутрішні значення енму типів.\nДодавання підтримки повідомлень з адаптера повідомлення-manager\nОновлені залежності\nДодано українські переклади\nОновлені переклади",
        "zh-cn": "最新差异\n评 注 处理: 活动类型和渠道类型现处于所有权情况。 例:现在正在推展,古ILD_TEXT现为GuildText。.\n评 注 处理: 在原材料中,所有类型的外地价值现在都代表了这种种类的内部价值。.\n增加通知-manager的电讯\nA. 最新依赖情况\n增加乌克兰翻译\n最新翻译"
      },
      "1.1.6": {
        "en": "Fixed voice channel member count/list",
        "de": "Die Anzahl und Liste der Mitglieder in Sprachkanälen werden nun korrekt aktualisiert",
        "ru": "Фиксированный счет/список голосового канала",
        "pt": "Contagem/lista de membro fixo do canal de voz",
        "nl": "Vertaling:",
        "fr": "Compte/liste des membres du canal vocal fixe",
        "it": "Conto/elenco dei membri del canale vocale fisso",
        "es": "Cuenta/lista miembro del canal de voz fijo",
        "pl": "Członek grupy głosowej liczy/list",
        "uk": "Виправлена ​​кількість/список учасників голосового каналу",
        "zh-cn": "固定声音传送成员计票/名单"
      },
      "1.1.5": {
        "en": "Made token validation less strict",
        "de": "Validierung des Tokens ist nun weniger streng",
        "ru": "Произведено подтверждение токена менее строго",
        "pt": "Validação token feita menos estrita",
        "nl": "Maakte voorwaardelijk minder strikt",
        "fr": "Validation des jetons moins stricte",
        "it": "Convalida dei token meno rigorosa",
        "es": "Validación de fichas menos estricta",
        "pl": "Czytelnia ta jest mniej ścisła",
        "uk": "Перевірка токенів стала менш суворою",
        "zh-cn": "D. 证据不足"
      },
      "1.1.4": {
        "en": "Fixed crash if custom command choices name was empty",
        "de": "Absturz behoben, wenn der Name einer Option eines benutzerdefinierten Befehls Name war leer",
        "ru": "Исправлена ошибка, если пользовательский выбор команды имя было пусто",
        "pt": "Corrigido acidente se o nome de escolhas de comando personalizado estava vazio",
        "nl": "Een crash als de gebruikelijke commando-naam leeg was",
        "fr": "Accident fixe si le nom de la commande personnalisée était vide",
        "it": "Crash fisso se il nome delle scelte di comando personalizzate era vuoto",
        "es": "Accidente fijo si las opciones de comando personalizado nombre estaba vacío",
        "pl": "Szczegółowa katastrofa, jeśli nazwa dowodzenia była pusta",
        "uk": "Виправлено збій, якщо ім’я вибору команди було порожнім",
        "zh-cn": "如果定制指挥选择名称是空洞,则固定的坠落。"
      },
      "1.1.3": {
        "en": "Dependency updates",
        "de": "Abhängigkeiten aktualisiert",
        "ru": "Обновление зависимости",
        "pt": "Atualizações de dependência",
        "nl": "Afhankelijke updates",
        "fr": "Mises à jour des dépenses",
        "it": "Aggiornamenti di dipendenza",
        "es": "Actualizaciones de dependencia",
        "pl": "Aktualizacja",
        "uk": "Оновлення залежностей",
        "zh-cn": "B. 附属更新"
      }
    },
    "title": "Discord",
    "titleLang": {
      "en": "Discord",
      "de": "Discord",
      "ru": "Discord",
      "pt": "Discord",
      "nl": "Discord",
      "fr": "Discord",
      "it": "Discord",
      "es": "Discord",
      "pl": "Discord",
      "uk": "Розбрат",
      "zh-cn": "Discord"
    },
    "desc": {
      "en": "Discord bot integration",
      "de": "Discord-Bot Integration",
      "ru": "Интеграция с дискорд-ботом",
      "pt": "Integração de bot do Discord",
      "nl": "Discord bot-integratie",
      "fr": "Intégration du robot Discord",
      "it": "Integrazione del bot Discord",
      "es": "Integración de bots de discordia",
      "pl": "Integracja z botem Discord",
      "uk": "Інтеграція бота Discord",
      "zh-cn": "Discord 机器人集成"
    },
    "authors": [
      "Peter Müller <peter@crycode.de>"
    ],
    "keywords": [
      "bot",
      "discord",
      "iobroker",
      "message",
      "notification"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "discord.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/crycode-de/ioBroker.discord/main/admin/discord.png",
    "readme": "https://github.com/crycode-de/ioBroker.discord/blob/main/README.md",
    "docs": {
      "en": "docs/en/README.md",
      "de": "docs/de/README.md"
    },
    "loglevel": "info",
    "mode": "daemon",
    "type": "messaging",
    "blockly": true,
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "push",
    "adminUI": {
      "custom": "json",
      "config": "json"
    },
    "messagebox": true,
    "supportedMessages": {
      "custom": true,
      "notifications": true
    },
    "supportCustoms": true,
    "plugins": {
      "sentry": {
        "dsn": "https://6ee57be76f2d4df2b592e3dbee37fb89@sentry.cryhost.de/8"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=4.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.3.0"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!",
          "uk": "Важливе повідомлення!"
        },
        "text": {
          "en": "Activity types and channel types are now in title case. Example: PLAYING is now Playing, GUILD_TEXT is now GuildText. In raw states all type field values are now numbers representing the internal enum values of the types. Please make sure to check and update your usages of the types after upgrading to version 2.0.0 or newer.",
          "de": "Aktivitätstypen und Kanaltypen sind nun in TitleCase. Beispiel: PLAYING ist jetzt Playing, GUILD_TEXT ist jetzt GuildText. In Rohzuständen sind nun alle type-Werte Zahlen, die den internen Enum-Werten der Typen entsprechen. Bitte darauf achten, die Verwenung von Typ-Werten nach dem Upgrade auf Version 2.0.0 oder neuer zu überprüfen und ggf. zu aktualisieren.",
          "ru": "Типы деятельности и типы каналов теперь в случае заголовка. Пример: PLAYING сейчас Playing, GUILD_TEXT теперь GuildText. В сырых состояниях все значения поля типа теперь цифры, представляющие внутренние значения enum типов. Пожалуйста, убедитесь, что проверить и обновить использование типов после обновления до версии 2.0.0 или новее.",
          "pt": "Tipos de atividade e tipos de canal estão agora no caso do título. Exemplo: PLAYING is now Playing, GUILD_TEXT is now GuildText. Em estados crus, todos os valores de campo do tipo são agora números que representam os valores enum internos dos tipos. Certifique-se de verificar e atualizar seus usos dos tipos após atualizar para a versão 2.0.0 ou mais recente.",
          "nl": "Activiteitstypes en kanaaltypes zijn nu in de zaak. PLAYING is nu Playing, GUILDTEXT is nu GuildText. In rauwe staten zijn alle veldwaarden nu cijfers die de interne waarden van de types vertegenwoordigen. Controleer alsjeblieft en update je gebruik van de types na het upgraden naar versie 2.0 of nieuwer.",
          "fr": "Les types d'activité et les types de canal sont maintenant dans le cas de titre. Exemple: PLAYING est maintenant Playing, GUILD_TEXT est maintenant GuildText. Dans les états bruts, toutes les valeurs de champ de type sont maintenant des nombres représentant les valeurs internes des types. Assurez-vous de vérifier et de mettre à jour vos utilisations des types après la mise à niveau de la version 2.0.0 ou plus récente.",
          "it": "I tipi di attività e i tipi di canale sono ora in caso di titolo. Esempio: PLAYING ora sta Playing, GUILD_TEXT è ora GuildText. In stati grezzi tutti i valori di campo di tipo sono ora numeri che rappresentano i valori enum interni dei tipi. Assicuratevi di controllare e aggiornare i vostri usi dei tipi dopo l'aggiornamento alla versione 2.0.0 o più recente.",
          "es": "Tipos de actividad y tipos de canal están ahora en caso de título. Ejemplo: PLAYING es ahora Playing, GUILD_TEXT es ahora GuildText. En estados brutos todos los valores de campo de tipo son ahora números que representan los valores internos de enum de los tipos. Asegúrese de comprobar y actualizar sus usos de los tipos después de actualizar a la versión 2.0.0 o más reciente.",
          "pl": "Wartość typów i typów kanałów jest obecnie w przypadku tytułowego. Przykład: PLAYING jest obecnie Playing, GUILD_TEXT jest obecnie GuildText. W surowych stanach wszystkie wartości pola są teraz numerami reprezentującymi wartości wewnętrzne typów. Zaświadczasz sobie, że sprawdzać i aktualizuje swoje typy po modernizacji do wersji 2.0.0 lub nowszego.",
          "uk": "Типи та типи каналів тепер у назвному випадку. Приклад: PLAYING тепер Playing, GUILD_TEXT тепер GuildText. У сирих штатах всі значення поля типу тепер є числа, що представляють внутрішні значення енму типів. Будь ласка, переконайтеся, що перевірити і оновити ваші використання типів після оновлення версії 2.0.0 або новачка.",
          "zh-cn": "活动类型和渠道类型现处于所有权情况。 例:现在正在推展,古ILD_TEXT现为GuildText。 在原材料中,所有类型的外地价值现在都代表了这些类型的内部价值。 请确保在升级至2.0.0或新版之后检查和更新这些类型。."
        },
        "link": "https://github.com/crycode-de/ioBroker.discord#changelog",
        "level": "warn",
        "linkText": {
          "en": "Changelog",
          "de": "Änderungsprotokoll",
          "ru": "Список изменений",
          "pt": "Registro de alterações",
          "nl": "Wijzigingslog",
          "fr": "Journal des modifications",
          "it": "Registro delle modifiche",
          "es": "registro de cambios",
          "pl": "Dziennik zmian",
          "zh-cn": "变更日志",
          "uk": "Журнал змін"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "protectedNative": [
    "token"
  ],
  "encryptedNative": [
    "token"
  ],
  "native": {
    "token": "",
    "botName": "",
    "processAllMessagesInServerChannel": false,
    "reactOnMentions": true,
    "reactOnMentionsEmoji": "👍",
    "text2commandInstance": "",
    "text2commandRespondWith": "reply",
    "dynamicServerUpdates": true,
    "observeUserPresence": false,
    "observeUserVoiceState": false,
    "enableRawStates": false,
    "enableAuthorization": true,
    "authorizedUsers": [],
    "authorizedServerRoles": [],
    "processMessagesFromUnauthorizedUsers": false,
    "enableCommands": false,
    "commandsGlobal": false,
    "commandRepliesEphemeral": false,
    "cmdGetStateName": "",
    "cmdSetStateName": "",
    "enableCustomCommands": false,
    "customCommands": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": {
          "en": "Information",
          "de": "Informationen",
          "ru": "Информация",
          "pt": "Em formação",
          "nl": "Informatie",
          "fr": "Information",
          "it": "Informazione",
          "es": "Información",
          "pl": "Informacja",
          "uk": "Інформація",
          "zh-cn": "信息"
        }
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": {
          "en": "Connected to discord",
          "de": "Verbunden mit Discord",
          "ru": "Подключен к дискорду",
          "pt": "Conectado à discórdia",
          "nl": "Verbonden met onenigheid",
          "fr": "Connecté à la discorde",
          "it": "Collegato alla discordia",
          "es": "Conectado a la discordia",
          "pl": "Połączony z niezgodą",
          "uk": "З'єднатися до дискорду",
          "zh-cn": "连接到不和谐"
        },
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "bot",
      "type": "channel",
      "common": {
        "name": {
          "en": "Bot",
          "de": "Bot",
          "ru": "Бот",
          "pt": "Robô",
          "nl": "Bot",
          "fr": "Robot",
          "it": "Bot",
          "es": "Bot",
          "pl": "Nerw",
          "uk": "Бодибилдерши",
          "zh-cn": "机器人"
        }
      },
      "native": {}
    },
    {
      "_id": "bot.status",
      "type": "state",
      "common": {
        "name": {
          "en": "Presence status",
          "de": "Anwesenheitsstatus",
          "ru": "Состояние присутствия",
          "pt": "Status de presença",
          "nl": "Aanwezigheidsstatus",
          "fr": "Statut de présence",
          "it": "Stato di presenza",
          "es": "Estado de presencia",
          "pl": "Status obecności",
          "uk": "Статус на сервери",
          "zh-cn": "存在状态"
        },
        "type": "string",
        "role": "text",
        "read": true,
        "write": true,
        "def": "online",
        "states": {
          "online": "online",
          "idle": "idle",
          "dnd": "dnd",
          "invisible": "invisible"
        }
      },
      "native": {}
    },
    {
      "_id": "bot.activityType",
      "type": "state",
      "common": {
        "name": {
          "en": "Activity type",
          "de": "Aktivitätstyp",
          "ru": "Тип деятельности",
          "pt": "Tipo de atividade",
          "nl": "Activiteitstype",
          "fr": "Type d'activité",
          "it": "Tipo di attività",
          "es": "Tipo de actividad",
          "pl": "Rodzaj aktywności",
          "uk": "Тип діяльності",
          "zh-cn": "活动类型"
        },
        "type": "string",
        "role": "text",
        "read": true,
        "write": true,
        "def": "Competing",
        "states": {
          "": "---",
          "Playing": "playing",
          "Streaming": "streaming",
          "Listening": "listening",
          "Watching": "watching",
          "Competing": "competing"
        }
      },
      "native": {}
    },
    {
      "_id": "bot.activityName",
      "type": "state",
      "common": {
        "name": {
          "en": "Activity name",
          "de": "Aktivitätsname",
          "ru": "Название деятельности",
          "pt": "Nome da atividade",
          "nl": "Naam activiteit",
          "fr": "Nom de l'activité",
          "it": "Nome dell'attività",
          "es": "Nombre de la actividad",
          "pl": "Nazwa działania",
          "uk": "Назва діяльності",
          "zh-cn": "活动名称"
        },
        "type": "string",
        "role": "text",
        "read": true,
        "write": true,
        "def": "ioBroker"
      },
      "native": {}
    },
    {
      "_id": "servers",
      "type": "channel",
      "common": {
        "name": {
          "en": "Servers",
          "de": "Server",
          "ru": "Серверы",
          "pt": "Servidores",
          "nl": "Servers",
          "fr": "Les serveurs",
          "it": "Server",
          "es": "Servidores",
          "pl": "Serwery",
          "uk": "Статус на сервери",
          "zh-cn": "服务器"
        }
      },
      "native": {}
    },
    {
      "_id": "users",
      "type": "channel",
      "common": {
        "name": {
          "en": "Users",
          "de": "Benutzer",
          "ru": "Пользователи",
          "pt": "Comercial",
          "nl": "Gebruikers",
          "fr": "Utilisateurs",
          "it": "Utenti",
          "es": "Usuarios",
          "pl": "Użytkownicy",
          "uk": "Користувачі",
          "zh-cn": "用户"
        }
      },
      "native": {}
    }
  ]
}
