{
    "Token": "Token",
    "Your bot token from the discord developers portal": "Bot-Token aus dem Discord-Entwicklerportal",
    "Members": "Mitglieder",
    "Channels": "Kanäle",
    "Roles": "Rollen",
    "Display name": "Anzeigename",
    "Joined at": "Beigetreten am",
    "JSON data": "JSON-Daten",
    "Member count": "Mitgliederzahl",
    "Last message": "Letzte Nachricht",
    "Last message ID": "ID der letzten Nachricht",
    "Last message author": "Autor der letzten Nachricht",
    "Last message timestamp": "Zeitstempel der letzten Nachricht",
    "Last message JSON data": "JSON-Daten der letzten Nachricht",
    "Send message": "Nachricht senden",
    "Send file": "Datei senden",
    "Send reply": "Antwort senden",
    "Send reaction": "Reaktion senden",
    "Avatar": "Benutzerbild",
    "Bot": "Bot",
    "Status": "Status",
    "Activity type": "Aktivitätstyp",
    "Activity name": "Aktivitätsname",
    "User tag": "Benutzer-Tag",
    "User name": "Nutzername",
    "Get an ioBroker state value": "Einen ioBroker-Zustand abfragen",
    "Set an ioBroker state value": "Einen ioBroker-Zustand setzen",
    "The ioBroker state to get": "Der ioBroker-Zustand, der abgerufen werden soll",
    "The ioBroker state to set": "Der zu setzende ioBroker-Zustand",
    "The value to set": "Der zu setzende Wert",
    "Unknown command!": "Unbekannter Befehl!",
    "You are not authorized to call this command!": "Du bist nicht berechtigt, diesen Befehl aufzurufen!",
    "Object `%s` not found!": "Objekt `%s` nicht gefunden!",
    "State `%s` not found!": "Zustand `%s` nicht gefunden!",
    "Object `%s` is not of type state!": "Objekt `%s` ist nicht vom Typ Zustand!",
    "true": "wahr",
    "false": "falsch",
    "not acknowledged": "nicht bestätigt",
    "Get not allowed for state `%s`!": "Abfragen vom Zustand `%s` nicht erlaubt!",
    "Set not allowed for state `%s`!": "Setzen vom Zustand `%s` nicht erlaubt!",
    "No value provided!": "Kein Wert angegeben!",
    "The given value is not a number!": "Der angegebene Wert ist keine Zahl!",
    "Value %s is below the allowed minimum of %s!": "Der Wert %s liegt unter dem zulässigen Minimum von %s!",
    "Value %s is above the allowed maximum of %s!": "Der Wert %s liegt über dem zulässigen Maximum von %s!",
    "on": "an",
    "off": "aus",
    "yes": "ja",
    "no": "nein",
    "Error while setting the state value!": "Fehler beim Setzen des Zustandswertes!",
    "🔗 Discord Developers Portal": "🔗 Discord-Entwicklerportal",
    "Name of the bot": "Name des Bots",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Den Name des Bots beim Start des Adapters festlegen. Leer lassen, um den aktuellen Namen des Bots beizubehalten.",
    "Dynamic server updates": "Dynamische Server-Updates",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Auf Server-, Kanal- und Benutzeraktualisierungen achten und Objekte entsprechend aktualisieren. Wenn deaktiviert, dann werden die Objekte nur beim Start des Adapter aktualisiert.",
    "Observe user presence": "Anwesenheit der Benutzer beobachten",
    "Observe presence status for all known users.": "Den Anwesenheitsstatus für alle bekannten Benutzer beobachten und speichern.",
    "Observe user voice state": "Sprachchatstatus der Benutzer beobachten",
    "Observe voice state for all known users.": "Den Sprachchatstatus für alle bekannten Benutzer beobachten und speichern.",
    "Messages": "Nachrichten",
    "Process all messages in server channels": "Alle Nachrichten in Serverkanälen verarbeiten",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Wenn diese Option aktiviert ist, werden alle Nachrichten in Serverkanälen vom Adapter verarbeitet. Andernfalls werden nur Nachrichten mit Erwähnungen verarbeitet.",
    "React on mentions": "Auf Erwähnungen reagieren",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Den Adapter auf Erwähnungen des Bots reagieren lassen. Wenn die Autorisierung aktiviert ist, dann wird nur auf Erwähnungen von autorisierten Benutzern reagiert.",
    "React with emoji": "Reagieren mit Emoji",
    "Emoji to react with on mentions. Default is 👍.": "Emoji zum Reagieren auf Erwähnungen. Standard ist 👍.",
    "text2command instance": "text2command-Instanz",
    "Send messages from states with enabled text2command to the given text2command instance.": "Nachrichten aus Zuständen mit aktiviertem text2command an die angegebene text2command-Instanz senden.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "Die Adapterinstanz muss laufen, um eine text2command-Instanz auswählen zu können!",
    "Response of text2command": "Antwort von text2command",
    "How the response of text2command is send.": "Wie die Antwort von text2command gesendet wird.",
    "Reply": "Antwort",
    "Message": "Nachricht",
    "None": "Keine",
    "Send ioBroker notifications to": "Sende ioBroker Benachrichtigungen an",
    "Send notifications from the ioBroker notifications system to the selected user or channel. The notification-manager adapter needs to be installed and running for this.": "Sende Benachrichtigungen vom ioBroker Benachrichtigungssystem an den ausgewählten Benutzer oder Kanal. Der notification-manager Adapter muss dafür installiert sein und laufen.",
    "Adapter instance needs to be running to be able to select a notification target!": "Die Adapterinstanz muss laufen, um ein Ziel für die Benachrichtigungen auswählen zu können!",
    "Authorization": "Autorisierung",
    "Enable authorization": "Autorisierung aktivieren",
    "If checked, only authorized users will be allowed to interact with the bot.": "Wenn diese Option aktiviert ist, dürfen nur autorisierte Benutzer mit dem Bot interagieren.",
    "Warning": "Warnung",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "Wenn die Autorisierung deaktiviert ist, kann jeder Benutzer mit dem Bot interagieren! Die Autorisierung sollte nur deaktiviert, wenn allen Benutzern auf allen Servern des Bots vertraut wird. Autorisierung wirklich deaktivieren?",
    "Ignore warning": "Warnung ignorieren",
    "Keep authorization enabled": "Autorisierung aktiviert lassen",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "Die Adapterinstanz muss ausgeführt werden, um zugelassene Benutzer aus einer Dropdown-Liste auswählen zu können! Andernfalls müssen die Benutzer-IDs manuell eingetragen werden.",
    "Allowed users": "Zugelassene Benutzer",
    "List of users allowed to interact with the bot.": "Liste der Benutzer, die mit dem Bot interagieren dürfen.",
    "User": "Benutzer",
    "Get states": "Zustände abfragen",
    "Set states": "Zustände festlegen",
    "Use text2command": "text2command verwenden",
    "Process messages from unauthorized users": "Nachrichten von nicht autorisierten Benutzern verarbeiten",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Wenn diese Option aktiviert ist, werden Nachrichten von allen Benutzern verarbeitet und in den .message-Zuständen gespeichert, aber sie lösen keine Adapteraktionen aus.",
    "Commands": "Befehle",
    "Enable commands": "Befehle aktivieren",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Wenn diese Option aktiviert ist, registriert der Bot Discord-Slash-Befehle, um ioBroker-Zustände abzurufen und festzulegen.",
    "Use global commands": "Globale Befehle verwenden",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Wenn diese Option aktiviert ist, dann werden die Slash-Befehle global registriert. Dadurch werden die Befehle auch in direktnachrichten verfügbar. Es kann jedoch bis zu einer Stunde dauern, bis Änderungen an den Befehlen in Discord übernommen werden.",
    "Custom get state command name": "Benutzerdefinierter Befehlsname zum Abrufen von Zuständen",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Benutzerdefinierter Name für den Befehl zum Abrufen von Zuständen. Standard ist 'iob-get'.",
    "Custom set state command name": "Benutzerdefinierter Befehlsname zum Festlegen von Zuständen",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Benutzerdefinierter Name für den Befehl zum Festlegen von Zuständen. Standard ist 'iob-set'.",
    "Enable text2command for this state": "text2command für diesen Zustand aktivieren",
    "When enabled, the received message is send to the configured text2command instance.": "Wenn aktiviert, wird die empfangene Nachricht an die konfigurierte text2command-Instanz gesendet.",
    "Enable discord commands for this state": "Discord-Befehle für diesen Zustand aktivieren",
    "Make this state available for discord commands.": "Diesen Zustand für Discord-Befehle verfügbar machen.",
    "Name": "Name",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Ein Name für dieses Objekt. Leer lassen, um den Namen des Objektes zu verwenden. Darf 100 Zeichen nicht überschreiten.",
    "Alias": "Alias",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Ein ID-Alias für dieses Objekt. Leer lassen, um die ID des Objektes zu verwenden. Darf 100 Zeichen nicht überschreiten.",
    "Allow get": "Abfragen zulassen",
    "Allow to get the state value by discord slash commands.": "Zulassen, dass der Wert des Zustands durch Discord-Slash-Befehle abgerufen werden kann.",
    "Allow set": "Festlegen zulassen",
    "Allow to set the state value by discord slash commands.": "Zulassen, dass der Wert des Zustands durch Discord-Slash-Befehle festgelegt werden kann.",
    "Show ack=false": "ack=false anzeigen",
    "Show an information on get commands if the state is not acknowledged.": "Zeigt eine Information bei Abfrage-Befehlen an, wenn der Zustand nicht bestätigt ist.",
    "Set with ack": "Mit ack festlegen",
    "Set a value with ack=true.": "Einen Wert mit ack=true festlegen.",
    "True value": "Wahrer Wert",
    "Value to be shown if the state is true.": "Anzuzeigender Wert, wenn der Zustand wahr ist.",
    "False value": "Falscher Wert",
    "Value to be shown if the state is false.": "Anzuzeigender Wert, wenn der Zustand falsch ist.",
    "Decimals": "Dezimalstellen",
    "Decimals to round the value to.": "Dezimalstellen, auf die der Wert gerundet werden soll.",
    "Send as file": "Als Datei versenden",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "Der Wert soll als Pfad oder URL zu einer Datei oder einem Base64-codierten Dateiinhalt behandelt werden. Die Datei wird als Anhang gesendet.",
    "Voice channel": "Sprachkanal",
    "Voice disconnect": "Sprachkanal trennen",
    "Voice self deafen": "Sprachkanal selbst taub",
    "Voice server deafen": "Sprachkanal Server taub",
    "Voice self mute": "Sprachkanal selbst stumm",
    "Voice server mute": "Sprachkanal Server stumm",
    "Add bot to server": "Bot zu einem Server hinzufügen",
    "Here you are able to get a link to add your bot to a discord server.": "Hier kann ein Link erstellt werden, über den der Discord-Bot einem Server hinzugefügt werden kann.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Um den Link zu erhalten, muss das Bot-Token auf der Registerkarte \"Allgemeine Einstellungen\" eingetragen, die Konfiguration gespeichert und die Adapterinstanz gestartet/neu gestartet werden.",
    "The adapter instance needs to be running to get the link!": "Die Adapterinstanz muss gestartet sein, um den Link zu erhalten!",
    "Link": "Link",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Einfach den Link in kopieren und in einem neuen Browser-Tab öffnen, um mit dem Hinzufügen des Bots zu einem Server zu starten.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "Die folgenden Bot-Berechtigungen werden vom Adapter benötigt und sind in dem obigen Link eingebettet:",
    "Change Nickname": "Spitznamen ändern",
    "Read Messages/View Channels": "Nachrichten lesen/Kanäle anzeigen",
    "Moderate Members": "Mitglieder moderieren",
    "Send Messages": "Nachrichten senden",
    "Embed Links": "Links einbetten",
    "Attach Files": "Dateien anhängen",
    "Read Message History": "Nachrichtenverlauf lesen",
    "Mention Everyone": "Jeden erwähnen",
    "Add Reactions": "Reaktionen hinzufügen",
    "Mute Members": "Mitglieder stummschalten",
    "Deafen Members": "Mitglieder gehörlosschalten",
    "Move Members": "Mitglieder verschieben",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Hinweis: Discord-Befehle müssen pro Zustand in den benutzerdefinierten Einstellungen der Zustandsobjekte aktiviert werden.",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Um einen Überblick über alle Zustandsobjekte zu erhalten, bei denen Befehle aktiviert sind, einfach auf die Schaltfläche unten klicken und dann die Protokollausgabe ansehen.",
    "Log state objects configured for commands": "Für Befehle konfigurierte Zustandsobjekte protokollieren",
    "See log output": "Siehe Protokollausgabe",
    "The adapter instance needs to be running to use this feature!": "Die Adapterinstanz muss ausgeführt werden, um diese Funktion nutzen zu können!",
    "Last interaction JSON data": "JSON-Daten der letzten Interaktion",
    "Raw data": "Rohdaten",
    "Enable raw states": "Rohdatenzustände aktivieren",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Wenn diese Option aktiviert ist, wird jede empfangene Nachricht in einem roh-JSON-Zustand gespeichert, sodass diese beispielsweise in benutzerdefinierten Skripten verwendet werden können.",
    "Allowed server roles": "Zugelassene Serverrollen",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Liste der Serverrollen, die mit dem Bot interagieren dürfen. Diese sind Serverspezifisch und werden nur auf Kanäle des jeweiligen Servers angewendet.",
    "Server role": "Serverrolle",
    "Here you are able to let the bot leave a discord server.": "Hier kann der Bot angewiesen werden einen Discord-Server zu verlassen.",
    "The adapter instance needs to be running to let the bot leave a server!": "Die Adapterinstanz muss gestartet sein, damit der Bot einen Server verlassen kann!",
    "Select server to leave": "Zu verlassenden Server auswählen",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Einen Server auswählen, den der Bot verlassen soll. Dann auf die Schaltfläche \"Server verlassen!\" klicken.",
    "Leave the server!": "Server verlassen!",
    "Do you really want to let the bot leave the selected server?": "Soll der Bot wirklich den ausgewählten Server verlassen?",
    "Yes, leave the server!": "Ja, den Server verlassen!",
    "Error: The Bot is not connected to Discord!": "Fehler: Der Bot ist nicht mit Discord verbunden!",
    "User ID": "Benutzer-ID",
    "Server ID": "Server-ID",
    "Channel ID": "Kanal-ID",
    "Interaction ID": "Interaktions-ID",
    "Custom Discord slash commands": "Benutzerdefinierte Discord-Slash-Befehle",
    "Last use timestamp": "Zeitstempel der letzten Verwendung",
    "Option %s": "Option %s",
    "Option %s value": "Option %s Wert",
    "Option %s choices": "Option %s Auswahlmöglichkeiten",
    "Use custom commands": "Benutzerdefinierte Befehle verwenden",
    "Enable custom commands": "Benutzerdefinierte Befehle aktivieren",
    "Define custom commands which may be used for interactions with scripts for example.": "Benutzerdefinierte Befehle definieren, die beispielsweise für Interaktionen mit Skripten verwendet werden können.",
    "Custom commands": "Benutzerdefinierte Befehle",
    "List of custom commands and their options.": "Liste der benutzerdefinierten Befehle und deren Optionen.",
    "Do something usefull": "Etwas Nützliches tun",
    "Command options": "Befehlsoptionen",
    "String": "Text",
    "Number": "Zahl",
    "Boolean": "Boolean",
    "Mentionable": "Erwähnbar",
    "option-1": "option-1",
    "Option 1": "Option 1",
    "Required": "Erforderlich",
    "Ephemeral replies": "Flüchtige Antworten",
    "If checked, all command replies will be send as ephemeral which will make the reply only visible to the user who executed the command.": "Wenn diese Option aktiviert ist, werden alle Befehlsantworten als flüchtig gesendet, sodass die Antwort nur für den Benutzer sichtbar ist, der den Befehl ausgeführt hat.",
    "Hint: For string options, you may set predefined options in the corresponding 'option-*.choices' state.": "Hinweis: Für Optionen vom Typ Text können im zugehörigen 'option-*.choices'-Zustand vordefinierte Auswahlmöglichkeiten festgelegt werden."
}
