{
    "Token": "Simbólico",
    "Your bot token from the discord developers portal": "Tu token de bot del portal de desarrolladores de discord",
    "Members": "Miembros",
    "Channels": "Canales",
    "Roles": "roles",
    "Display name": "Nombre para mostrar",
    "Joined at": "Se unió a",
    "JSON data": "datos JSON",
    "Member count": "Cuenta de miembro",
    "Last message": "Ultimo mensaje",
    "Last message ID": "Identificación del último mensaje",
    "Last message author": "Autor del último mensaje",
    "Last message timestamp": "Marca de tiempo del último mensaje",
    "Last message JSON data": "Datos JSON del último mensaje",
    "Send message": "Enviar mensaje",
    "Send file": "Enviar archivo",
    "Send reply": "Enviar respuesta",
    "Send reaction": "Enviar reacción",
    "Avatar": "Avatar",
    "Bot": "Bot",
    "Status": "Estado",
    "Activity type": "Tipo de actividad",
    "Activity name": "Nombre de la actividad",
    "User tag": "Etiqueta de usuario",
    "Get an ioBroker state value": "Obtener un valor de estado de ioBroker",
    "Set an ioBroker state value": "Establecer un valor de estado de ioBroker",
    "The ioBroker state to get": "El estado de ioBroker para obtener",
    "The ioBroker state to set": "El estado de ioBroker para establecer",
    "The value to set": "El valor a establecer",
    "Unknown command!": "¡Comando desconocido!",
    "You are not authorized to call this command!": "¡No está autorizado a llamar a este comando!",
    "Object `%s` not found!": "¡Objeto `%s` no encontrado!",
    "State `%s` not found!": "¡No se encontró el estado `%s`!",
    "Object `%s` is not of type state!": "¡El objeto `%s` no es de tipo state!",
    "true": "verdadero",
    "false": "falso",
    "not acknowledged": "no reconocido",
    "Get not allowed for state `%s`!": "¡Obtenga no permitido para el estado `%s`!",
    "Set not allowed for state `%s`!": "¡Conjunto no permitido para el estado `%s`!",
    "No value provided!": "¡No se proporciona ningún valor!",
    "The given value is not a number!": "¡El valor dado no es un número!",
    "Value %s is below the allowed minium of %s!": "¡El valor %s está por debajo del mínimo permitido de %s!",
    "Value %s is above the allowed maximum of %s!": "¡El valor %s está por encima del máximo permitido de %s!",
    "on": "sobre",
    "off": "apagado",
    "yes": "sí",
    "no": "no",
    "Error while setting the state value!": "¡Error al configurar el valor del estado!",
    "🔗 Discord Developers Portal": "🔗 Portal de desarrolladores de Discord",
    "Name of the bot": "nombre del bot",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Establezca un nombre para el bot al iniciar el adaptador. ",
    "Dynamic server updates": "Actualizaciones dinámicas del servidor",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Esté atento a las actualizaciones de servidor, canal y usuario y actualice los objetos según corresponda. ",
    "Observe user presence": "Observar la presencia del usuario",
    "Observe presence status for all known users.": "Observe el estado de presencia de todos los usuarios conocidos.",
    "Messages": "Mensajes",
    "Process all messages in server channels": "Procesar todos los mensajes en los canales del servidor",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Si está marcado, el adaptador procesará todos los mensajes en los canales del servidor. ",
    "React on mentions": "Reaccionar a las menciones",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Deje que el adaptador reaccione ante las menciones de bots. ",
    "React with emoji": "Reacciona con emojis",
    "Emoji to react with on mentions. Default is 👍.": "Emoji para reaccionar con las menciones. ",
    "text2command instance": "instancia de comando de texto2",
    "Send messages from states with enabled text2command to the given text2command instance.": "Envíe mensajes desde estados con text2command habilitado a la instancia de text2command dada.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "¡La instancia del adaptador debe estar ejecutándose para poder seleccionar una instancia de text2command!",
    "Response of text2command": "Respuesta de text2command",
    "How the response of text2command is send.": "Cómo se envía la respuesta de text2command.",
    "Reply": "Respuesta",
    "Message": "Mensaje",
    "None": "Ninguna",
    "Authorization": "Autorización",
    "Enable authorization": "Habilitar autorización",
    "If checked, only authorized users will be allowed to interact with the bot.": "Si está marcado, solo los usuarios autorizados podrán interactuar con el bot.",
    "Warning": "Advertencia",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "Cuando la autorización está deshabilitada, ¡cualquier usuario puede interactuar con el bot! ",
    "Ignore warning": "Ignorar advertencia",
    "Keep authorization enabled": "Mantener la autorización habilitada",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "¡La instancia del adaptador debe estar ejecutándose para poder seleccionar usuarios permitidos de una lista desplegable! ",
    "Allowed users": "Usuarios permitidos",
    "List of users allowed to interact with the bot.": "Lista de usuarios autorizados a interactuar con el bot.",
    "User": "Usuario",
    "Get states": "Obtener estados",
    "Set states": "Establecer estados",
    "Use text2command": "Usa el comando text2",
    "Process messages from unauthorized users": "Procesar mensajes de usuarios no autorizados",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Si está marcado, los mensajes de todos los usuarios se procesarán y almacenarán en los estados .message, pero no activarán ninguna acción del adaptador.",
    "Commands": "Comandos",
    "Enable commands": "Habilitar comandos",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Si está marcado, el bot registrará los comandos de barra discord para obtener y establecer los estados de ioBroker.",
    "Custom get state command name": "Nombre de comando de estado de obtención personalizado",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Nombre personalizado para el comando obtener estado. ",
    "Custom set state command name": "Nombre de comando de estado de conjunto personalizado",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Nombre personalizado para el comando establecer estado. ",
    "Enable text2command for this state": "Habilite text2command para este estado",
    "When enabled, the received message is send to the configured text2command instance.": "Cuando está habilitado, el mensaje recibido se envía a la instancia configurada de text2command.",
    "Enable discord commands for this state": "Habilitar comandos de discordia para este estado",
    "Make this state available for discord commands.": "Haga que este estado esté disponible para los comandos de discordia.",
    "Name": "Nombre",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Un nombre para este objeto. ",
    "Alias": "Alias",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Un alias de ID para este objeto. ",
    "Allow get": "Permitir obtener",
    "Allow to get the state value by discord slash commands.": "Permita obtener el valor del estado mediante los comandos de barra discord.",
    "Allow set": "Permitir conjunto",
    "Allow to set the state value by discord slash commands.": "Permita establecer el valor del estado mediante los comandos de barra discord.",
    "Show ack=false": "Mostrar reconocimiento = falso",
    "Show an information on get commands if the state is not acknowledged.": "Muestra información sobre los comandos get si no se reconoce el estado.",
    "Set with ack": "Establecer con acuse de recibo",
    "Set a value with ack=true.": "Establezca un valor con ack=true.",
    "True value": "Verdadero valor",
    "Value to be shown if the state is true.": "Valor que se mostrará si el estado es verdadero.",
    "False value": "valor falso",
    "Value to be shown if the state is false.": "Valor a mostrar si el estado es falso.",
    "Decimals": "decimales",
    "Decimals to round the value to.": "Decimales a los que redondear el valor.",
    "Send as file": "Enviar como archivo",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "El valor debe tratarse como ruta o URL a un archivo o contenido de archivo codificado en base64. ",
    "Voice channel": "canal de voz",
    "Voice disconnect": "Desconexión de voz",
    "Voice self deafen": "Voz ensordecedora",
    "Voice server deafen": "Servidor de voz sordo",
    "Voice self mute": "Silencio automático de voz",
    "Voice server mute": "Silencio del servidor de voz",
    "Observe user voice state": "Observar el estado de la voz del usuario",
    "Observe voice state for all known users.": "Observe el estado de voz de todos los usuarios conocidos.",
    "Use global commands": "Usar comandos globales",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Si está marcado, los comandos de barra se registrarán globalmente. ",
    "Add bot to server": "Agregar bot al servidor",
    "Here you are able to get a link to add your bot to a discord server.": "Aquí puede obtener un enlace para agregar su bot a un servidor de discordia.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Para obtener el enlace, debe insertar su token de bot en la pestaña de configuración principal, guardar las configuraciones e iniciar/reiniciar la instancia del adaptador.",
    "The adapter instance needs to be running to get the link!": "¡La instancia del adaptador debe estar ejecutándose para obtener el enlace!",
    "Link": "Enlace",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Simplemente copie el enlace y ábralo en una nueva pestaña del navegador para comenzar a agregar el bot a un servidor.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "El adaptador requiere los siguientes permisos de bot y están integrados en el enlace anterior:",
    "Change Nickname": "Cambiar apodo",
    "Read Messages/View Channels": "Leer mensajes/Ver canales",
    "Moderate Members": "Miembros moderados",
    "Send Messages": "Enviar mensajes",
    "Embed Links": "Insertar enlaces",
    "Attach Files": "Adjuntar archivos",
    "Read Message History": "Leer historial de mensajes",
    "Mention Everyone": "Mencionar a todos",
    "Add Reactions": "Añadir reacciones",
    "Mute Members": "Silenciar miembros",
    "Deafen Members": "Miembros sordos",
    "Move Members": "Mover miembros",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Para obtener una descripción general de todos los objetos de estado donde tiene comandos habilitados, simplemente haga clic en el botón a continuación y vea la salida del registro.",
    "Log state objects configured for commands": "Objetos de estado de registro configurados para comandos",
    "See log output": "Ver salida de registro",
    "The adapter instance needs to be running to use this feature!": "¡La instancia del adaptador debe estar ejecutándose para usar esta función!",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Sugerencia: los comandos de Discord deben habilitarse por estado en la configuración personalizada de los objetos de estado.",
    "Last interaction JSON data": "Datos JSON de la última interacción",
    "Raw data": "Datos sin procesar",
    "Enable raw states": "Habilitar estados sin procesar",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Si está habilitado, cualquier mensaje recibido se almacenará en un estado json sin procesar, por lo que podría usarse en scripts personalizados, por ejemplo.",
    "Allowed server roles": "Roles de servidor permitidos",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Lista de roles de servidor que pueden interactuar con el bot. ",
    "Server role": "Rol del servidor"
}
