{
    "Token": "Jeton",
    "Your bot token from the discord developers portal": "Votre jeton de bot du portail des développeurs discord",
    "Members": "Membres",
    "Channels": "Chaînes",
    "Roles": "Les rôles",
    "Display name": "Afficher un nom",
    "Joined at": "Inscrit à",
    "JSON data": "Données JSON",
    "Member count": "Nombre de membres",
    "Last message": "Dernier message",
    "Last message ID": "Identifiant du dernier message",
    "Last message author": "Auteur du dernier message",
    "Last message timestamp": "Horodatage du dernier message",
    "Last message JSON data": "Données JSON du dernier message",
    "Send message": "Envoyer le message",
    "Send file": "Envoyer le fichier",
    "Send reply": "Envoyer la réponse",
    "Send reaction": "Envoyer la réaction",
    "Avatar": "Avatar",
    "Bot": "Robot",
    "Status": "Statut",
    "Activity type": "Type d'activité",
    "Activity name": "Nom de l'activité",
    "User tag": "Balise d'utilisateur",
    "Get an ioBroker state value": "Obtenir une valeur d'état ioBroker",
    "Set an ioBroker state value": "Définir une valeur d'état ioBroker",
    "The ioBroker state to get": "L'état ioBroker pour obtenir",
    "The ioBroker state to set": "L'état ioBroker à définir",
    "The value to set": "La valeur à définir",
    "Unknown command!": "Commande inconnue!",
    "You are not authorized to call this command!": "Vous n'êtes pas autorisé à appeler cette commande !",
    "Object `%s` not found!": "Objet `%s` introuvable !",
    "State `%s` not found!": "État `%s` introuvable !",
    "Object `%s` is not of type state!": "L'objet `%s` n'est pas de type état !",
    "true": "vrai",
    "false": "faux",
    "not acknowledged": "non reconnu",
    "Get not allowed for state `%s`!": "N'est pas autorisé pour l'état `%s` !",
    "Set not allowed for state `%s`!": "Définir non autorisé pour l'état `%s` !",
    "No value provided!": "Aucune valeur fournie !",
    "The given value is not a number!": "La valeur donnée n'est pas un nombre !",
    "Value %s is below the allowed minium of %s!": "La valeur %s est inférieure au minimum autorisé de %s !",
    "Value %s is above the allowed maximum of %s!": "La valeur %s est supérieure au maximum autorisé de %s !",
    "on": "sur",
    "off": "désactivé",
    "yes": "oui",
    "no": "non",
    "Error while setting the state value!": "Erreur lors de la définition de la valeur d'état !",
    "🔗 Discord Developers Portal": "🔗 Portail des développeurs Discord",
    "Name of the bot": "Nom du robot",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Définissez un nom pour le bot au démarrage de l'adaptateur. ",
    "Dynamic server updates": "Mises à jour dynamiques du serveur",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Surveillez les mises à jour des serveurs, des canaux et des utilisateurs et mettez à jour les objets en conséquence. ",
    "Observe user presence": "Observer la présence de l'utilisateur",
    "Observe presence status for all known users.": "Observez le statut de présence de tous les utilisateurs connus.",
    "Messages": "messages",
    "Process all messages in server channels": "Traiter tous les messages dans les canaux du serveur",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Si cette case est cochée, tous les messages des canaux du serveur seront traités par l'adaptateur. ",
    "React on mentions": "Réagissez aux mentions",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Laissez l'adaptateur réagir aux mentions de bot. ",
    "React with emoji": "Réagissez avec des emoji",
    "Emoji to react with on mentions. Default is 👍.": "Emoji avec lequel réagir aux mentions. ",
    "text2command instance": "instance text2command",
    "Send messages from states with enabled text2command to the given text2command instance.": "Envoyez des messages à partir des états avec text2command activé à l'instance text2command donnée.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "L'instance de l'adaptateur doit être en cours d'exécution pour pouvoir sélectionner une instance de text2command !",
    "Response of text2command": "Réponse de text2command",
    "How the response of text2command is send.": "Comment la réponse de text2command est envoyée.",
    "Reply": "Réponse",
    "Message": "Message",
    "None": "Rien",
    "Authorization": "Autorisation",
    "Enable authorization": "Activer l'autorisation",
    "If checked, only authorized users will be allowed to interact with the bot.": "Si cette case est cochée, seuls les utilisateurs autorisés seront autorisés à interagir avec le bot.",
    "Warning": "Avertissement",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "Lorsque l'autorisation est désactivée, n'importe quel utilisateur peut interagir avec le bot ! ",
    "Ignore warning": "Ignorer l'avertissement",
    "Keep authorization enabled": "Maintenir l'autorisation activée",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "L'instance de l'adaptateur doit être en cours d'exécution pour pouvoir sélectionner les utilisateurs autorisés dans une liste déroulante ! ",
    "Allowed users": "Utilisateurs autorisés",
    "List of users allowed to interact with the bot.": "Liste des utilisateurs autorisés à interagir avec le bot.",
    "User": "Utilisateur",
    "Get states": "Obtenir des états",
    "Set states": "Définir les états",
    "Use text2command": "Utiliser la commande text2",
    "Process messages from unauthorized users": "Traiter les messages d'utilisateurs non autorisés",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Si cette case est cochée, les messages de tous les utilisateurs seront traités et stockés dans les états .message, mais ils ne déclencheront aucune action de l'adaptateur.",
    "Commands": "Commandes",
    "Enable commands": "Activer les commandes",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Si cette case est cochée, le bot enregistrera les commandes slash discord pour obtenir et définir les états ioBroker.",
    "Custom get state command name": "Nom de commande get state personnalisé",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Nom personnalisé pour la commande get state. ",
    "Custom set state command name": "Nom de commande d'état défini personnalisé",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Nom personnalisé pour la commande set state. ",
    "Enable text2command for this state": "Activer text2command pour cet état",
    "When enabled, the received message is send to the configured text2command instance.": "Lorsqu'il est activé, le message reçu est envoyé à l'instance text2command configurée.",
    "Enable discord commands for this state": "Activer les commandes discord pour cet état",
    "Make this state available for discord commands.": "Rendez cet état disponible pour les commandes Discord.",
    "Name": "Nom",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Un nom pour cet objet. ",
    "Alias": "Alias",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Un alias d'ID pour cet objet. ",
    "Allow get": "Autoriser obtenir",
    "Allow to get the state value by discord slash commands.": "Autoriser l'obtention de la valeur d'état par les commandes slash discord.",
    "Allow set": "Autoriser l'ensemble",
    "Allow to set the state value by discord slash commands.": "Permet de définir la valeur d'état par les commandes de barre oblique discord.",
    "Show ack=false": "Afficher ack=false",
    "Show an information on get commands if the state is not acknowledged.": "Affiche une information sur les commandes get si l'état n'est pas reconnu.",
    "Set with ack": "Set avec accusé de réception",
    "Set a value with ack=true.": "Définissez une valeur avec ack=true.",
    "True value": "Vraie valeur",
    "Value to be shown if the state is true.": "Valeur à afficher si l'état est vrai.",
    "False value": "Fausse valeur",
    "Value to be shown if the state is false.": "Valeur à afficher si l'état est faux.",
    "Decimals": "Décimales",
    "Decimals to round the value to.": "Décimales pour arrondir la valeur.",
    "Send as file": "Envoyer en tant que fichier",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "La valeur doit être traitée comme un chemin ou une URL vers un fichier ou un contenu de fichier encodé en base64. ",
    "Voice channel": "Canal vocal",
    "Voice disconnect": "Déconnexion vocale",
    "Voice self deafen": "Voix auto assourdie",
    "Voice server deafen": "Serveur vocal assourdi",
    "Voice self mute": "Voix auto muette",
    "Voice server mute": "Serveur vocal muet",
    "Observe user voice state": "Observer l'état de la voix de l'utilisateur",
    "Observe voice state for all known users.": "Observez l'état de la voix pour tous les utilisateurs connus.",
    "Use global commands": "Utiliser les commandes globales",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Si cette case est cochée, les commandes slash seront enregistrées globalement. ",
    "Add bot to server": "Ajouter un robot au serveur",
    "Here you are able to get a link to add your bot to a discord server.": "Ici, vous pouvez obtenir un lien pour ajouter votre bot à un serveur discord.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Pour obtenir le lien, vous devez insérer votre jeton de bot dans l'onglet des paramètres principaux, enregistrer les configurations et démarrer/redémarrer l'instance de l'adaptateur.",
    "The adapter instance needs to be running to get the link!": "L'instance de l'adaptateur doit être en cours d'exécution pour obtenir le lien !",
    "Link": "Lien",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Copiez simplement le lien et ouvrez-le dans un nouvel onglet du navigateur pour commencer à ajouter le bot à un serveur.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "Les autorisations de bot suivantes sont requises par l'adaptateur et intégrées dans le lien ci-dessus :",
    "Change Nickname": "Changer de pseudo",
    "Read Messages/View Channels": "Lire les messages/afficher les canaux",
    "Moderate Members": "Membres modérés",
    "Send Messages": "Envoyer des messages",
    "Embed Links": "Intégrer des liens",
    "Attach Files": "Joindre des fichiers",
    "Read Message History": "Lire l'historique des messages",
    "Mention Everyone": "Mentionnez tout le monde",
    "Add Reactions": "Ajouter des réactions",
    "Mute Members": "Membres muets",
    "Deafen Members": "Membres sourds",
    "Move Members": "Déplacer des membres",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Pour obtenir un aperçu de tous les objets d'état où vous avez des commandes activées, cliquez simplement sur le bouton ci-dessous et consultez la sortie du journal.",
    "Log state objects configured for commands": "Objets d'état du journal configurés pour les commandes",
    "See log output": "Voir la sortie du journal",
    "The adapter instance needs to be running to use this feature!": "L'instance de l'adaptateur doit être en cours d'exécution pour utiliser cette fonctionnalité !",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Astuce : les commandes Discord doivent être activées par état dans les paramètres personnalisés des objets d'état.",
    "Last interaction JSON data": "Données JSON de la dernière interaction",
    "Raw data": "Données brutes",
    "Enable raw states": "Activer les états bruts",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Si activé, tout message reçu sera stocké dans un état json brut, il pourra donc être utilisé dans des scripts personnalisés par exemple.",
    "Allowed server roles": "Rôles de serveur autorisés",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Liste des rôles de serveur autorisés à interagir avec le bot. ",
    "Server role": "Rôle de serveur",
    "Here you are able to let the bot leave a discord server.": "Ici, vous pouvez laisser le bot quitter un serveur discord.",
    "The adapter instance needs to be running to let the bot leave a server!": "L'instance de l'adaptateur doit être en cours d'exécution pour permettre au bot de quitter un serveur !",
    "Select server to leave": "Sélectionnez le serveur à quitter",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Sélectionnez un serveur que vous souhaitez que le bot quitte, puis cliquez sur \"Quitter le serveur !\" ",
    "Leave the server!": "Quittez le serveur !",
    "Do you really want to let the bot leave the selected server?": "Voulez-vous vraiment laisser le bot quitter le serveur sélectionné ?",
    "Yes, leave the server!": "Oui, quittez le serveur !",
    "Error: The Bot is not connected to Discord!": "Erreur : Le bot n'est pas connecté à Discord !",
    "User ID": "Identifiant d'utilisateur",
    "Server ID": "Identifiant du serveur",
    "Channel ID": "Identifiant de la chaine",
    "Interaction ID": "ID d'interaction",
    "Custom Discord slash commands": "Commandes slash Discord personnalisées",
    "Last use timestamp": "Horodatage de la dernière utilisation",
    "Option %s": "Choix %s",
    "Use custom commands": "Utiliser des commandes personnalisées",
    "Enable custom commands": "Activer les commandes personnalisées",
    "Define custom commands which may be used for interactions with scripts for example.": "Définissez des commandes personnalisées qui peuvent être utilisées pour des interactions avec des scripts par exemple.",
    "Custom commands": "Commandes personnalisées",
    "List of custom commands and their options.": "Liste des commandes personnalisées et leurs options.",
    "Do something usefull": "Faire quelque chose d'utile",
    "Command options": "Options de commande",
    "String": "Corde",
    "Number": "Numéro",
    "Boolean": "booléen",
    "Mentionable": "Mentionnable",
    "option-1": "Option 1",
    "Option 1": "Option 1",
    "Required": "Obligatoire"
}
