{
    "Token": "Gettone",
    "Your bot token from the discord developers portal": "Il tuo token bot dal portale degli sviluppatori discord",
    "Members": "Membri",
    "Channels": "Canali",
    "Roles": "Ruoli",
    "Display name": "Nome da visualizzare",
    "Joined at": "Iscritto a",
    "JSON data": "Dati JSON",
    "Member count": "Conte membro",
    "Last message": "Ultimo messaggio",
    "Last message ID": "ID ultimo messaggio",
    "Last message author": "Autore ultimo messaggio",
    "Last message timestamp": "Data e ora dell'ultimo messaggio",
    "Last message JSON data": "Dati JSON dell'ultimo messaggio",
    "Send message": "Invia messaggio",
    "Send file": "Inviare file",
    "Send reply": "Invia risposta",
    "Send reaction": "Invia reazione",
    "Avatar": "Avatar",
    "Bot": "Bot",
    "Status": "Stato",
    "Activity type": "Tipo di attività",
    "Activity name": "Nome dell'attività",
    "User tag": "Etichetta utente",
    "Get an ioBroker state value": "Ottieni un valore di stato ioBroker",
    "Set an ioBroker state value": "Imposta un valore di stato ioBroker",
    "The ioBroker state to get": "Lo stato ioBroker da ottenere",
    "The ioBroker state to set": "Lo stato ioBroker da impostare",
    "The value to set": "Il valore da impostare",
    "Unknown command!": "Comando sconosciuto!",
    "You are not authorized to call this command!": "Non sei autorizzato a chiamare questo comando!",
    "Object `%s` not found!": "Oggetto `%s` non trovato!",
    "State `%s` not found!": "Stato `%s` non trovato!",
    "Object `%s` is not of type state!": "L'oggetto `%s` non è di tipo state!",
    "true": "VERO",
    "false": "falso",
    "not acknowledged": "non riconosciuto",
    "Get not allowed for state `%s`!": "Non essere consentito per lo stato `%s`!",
    "Set not allowed for state `%s`!": "Impostazione non consentita per lo stato `%s`!",
    "No value provided!": "Nessun valore fornito!",
    "The given value is not a number!": "Il valore dato non è un numero!",
    "Value %s is below the allowed minium of %s!": "Il valore %s è inferiore al minimo consentito di %s!",
    "Value %s is above the allowed maximum of %s!": "Il valore %s è superiore al massimo consentito di %s!",
    "on": "su",
    "off": "spento",
    "yes": "sì",
    "no": "No",
    "Error while setting the state value!": "Errore durante l'impostazione del valore di stato!",
    "🔗 Discord Developers Portal": "🔗 Portale per sviluppatori Discord",
    "Name of the bot": "Nome del bot",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Imposta un nome per il bot all'avvio dell'adattatore. ",
    "Dynamic server updates": "Aggiornamenti dinamici del server",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Controlla gli aggiornamenti del server, del canale e dell'utente e aggiorna gli oggetti in base. ",
    "Observe user presence": "Osservare la presenza dell'utente",
    "Observe presence status for all known users.": "Osservare lo stato di presenza per tutti gli utenti conosciuti.",
    "Messages": "Messaggi",
    "Process all messages in server channels": "Elabora tutti i messaggi nei canali del server",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Se selezionato, tutti i messaggi nei canali del server verranno elaborati dall'adattatore. ",
    "React on mentions": "Reagire alle menzioni",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Lascia che l'adattatore reagisca alle menzioni del bot. ",
    "React with emoji": "Reagisci con le emoji",
    "Emoji to react with on mentions. Default is 👍.": "Emoji con cui reagire alle menzioni. ",
    "text2command instance": "istanza text2command",
    "Send messages from states with enabled text2command to the given text2command instance.": "Invia messaggi dagli stati con text2command abilitato all'istanza text2command specificata.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "L'istanza dell'adattatore deve essere in esecuzione per poter selezionare un'istanza di text2command!",
    "Response of text2command": "Risposta del comando text2",
    "How the response of text2command is send.": "Come viene inviata la risposta di text2command.",
    "Reply": "rispondere",
    "Message": "Messaggio",
    "None": "Nessuno",
    "Authorization": "Autorizzazione",
    "Enable authorization": "Abilita autorizzazione",
    "If checked, only authorized users will be allowed to interact with the bot.": "Se selezionato, solo gli utenti autorizzati potranno interagire con il bot.",
    "Warning": "Avvertimento",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "Quando l'autorizzazione è disabilitata, qualsiasi utente è in grado di interagire con il bot! ",
    "Ignore warning": "Ignora avviso",
    "Keep authorization enabled": "Mantieni l'autorizzazione abilitata",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "L'istanza dell'adattatore deve essere in esecuzione per poter selezionare gli utenti consentiti da un elenco a discesa! ",
    "Allowed users": "Utenti consentiti",
    "List of users allowed to interact with the bot.": "Elenco degli utenti autorizzati a interagire con il bot.",
    "User": "Utente",
    "Get states": "Ottieni stati",
    "Set states": "Stabilisci gli stati",
    "Use text2command": "Usa text2command",
    "Process messages from unauthorized users": "Elabora messaggi da utenti non autorizzati",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Se selezionato, i messaggi di tutti gli utenti verranno elaborati e archiviati negli stati .message, ma non attiveranno alcuna azione dell'adattatore.",
    "Commands": "Comandi",
    "Enable commands": "Abilita comandi",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Se selezionato, il bot registrerà i comandi discord slash per ottenere e impostare gli stati di ioBroker.",
    "Custom get state command name": "Nome del comando get state personalizzato",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Nome personalizzato per il comando get state. ",
    "Custom set state command name": "Nome del comando dello stato impostato personalizzato",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Nome personalizzato per il comando set state. ",
    "Enable text2command for this state": "Abilita text2command per questo stato",
    "When enabled, the received message is send to the configured text2command instance.": "Se abilitato, il messaggio ricevuto viene inviato all'istanza text2command configurata.",
    "Enable discord commands for this state": "Abilita i comandi discord per questo stato",
    "Make this state available for discord commands.": "Rendi disponibile questo stato per i comandi discord.",
    "Name": "Nome",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Un nome per questo oggetto. ",
    "Alias": "Alias",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Un alias ID per questo oggetto. ",
    "Allow get": "Consenti ottenere",
    "Allow to get the state value by discord slash commands.": "Consenti di ottenere il valore dello stato tramite i comandi discord slash.",
    "Allow set": "Consenti set",
    "Allow to set the state value by discord slash commands.": "Consenti di impostare il valore dello stato tramite i comandi discord slash.",
    "Show ack=false": "Mostra ack=falso",
    "Show an information on get commands if the state is not acknowledged.": "Mostra un'informazione sui comandi get se lo stato non viene riconosciuto.",
    "Set with ack": "Impostare con ck",
    "Set a value with ack=true.": "Imposta un valore con ack=true.",
    "True value": "Vero valore",
    "Value to be shown if the state is true.": "Valore da mostrare se lo stato è vero.",
    "False value": "Valore falso",
    "Value to be shown if the state is false.": "Valore da mostrare se lo stato è false.",
    "Decimals": "Decimali",
    "Decimals to round the value to.": "Decimali a cui arrotondare il valore.",
    "Send as file": "Invia come file",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "Il valore deve essere considerato come il percorso o l'URL di un file o il contenuto di un file con codifica base64. ",
    "Voice channel": "Canale vocale",
    "Voice disconnect": "Disconnessione vocale",
    "Voice self deafen": "Voce autosordante",
    "Voice server deafen": "Server vocale assordante",
    "Voice self mute": "Voce silenziata automaticamente",
    "Voice server mute": "Disattivazione del server vocale",
    "Observe user voice state": "Osservare lo stato della voce dell'utente",
    "Observe voice state for all known users.": "Osserva lo stato della voce per tutti gli utenti conosciuti.",
    "Use global commands": "Usa i comandi globali",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Se selezionato, i comandi slash verranno registrati a livello globale. ",
    "Add bot to server": "Aggiungi bot al server",
    "Here you are able to get a link to add your bot to a discord server.": "Qui puoi ottenere un link per aggiungere il tuo bot a un server discord.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Per ottenere il collegamento, è necessario inserire il token del bot nella scheda delle impostazioni principali, salvare le configurazioni e avviare/riavviare l'istanza dell'adattatore.",
    "The adapter instance needs to be running to get the link!": "L'istanza dell'adattatore deve essere in esecuzione per ottenere il collegamento!",
    "Link": "Collegamento",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Basta copiare il collegamento e aprirlo in una nuova scheda del browser per iniziare ad aggiungere il bot a un server.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "Le seguenti autorizzazioni bot sono richieste dall'adattatore e incorporate nel collegamento sopra:",
    "Change Nickname": "Cambia soprannome",
    "Read Messages/View Channels": "Leggi messaggi/Visualizza canali",
    "Moderate Members": "Membri moderati",
    "Send Messages": "Manda messaggi",
    "Embed Links": "Incorpora collegamenti",
    "Attach Files": "Allegati",
    "Read Message History": "Leggi la cronologia dei messaggi",
    "Mention Everyone": "Menziona tutti",
    "Add Reactions": "Aggiungi reazioni",
    "Mute Members": "Membri muti",
    "Deafen Members": "Membri sordi",
    "Move Members": "Sposta membri",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Per avere una panoramica di tutti gli oggetti di stato in cui hai i comandi abilitati, fai semplicemente clic sul pulsante in basso e guarda l'output del registro.",
    "Log state objects configured for commands": "Registra gli oggetti di stato configurati per i comandi",
    "See log output": "Vedi l'output del registro",
    "The adapter instance needs to be running to use this feature!": "L'istanza dell'adattatore deve essere in esecuzione per utilizzare questa funzione!",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Suggerimento: i comandi Discord devono essere abilitati per stato nelle impostazioni personalizzate degli oggetti stato.",
    "Last interaction JSON data": "Dati JSON dell'ultima interazione",
    "Raw data": "Dati grezzi",
    "Enable raw states": "Abilita stati grezzi",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Se abilitato, qualsiasi messaggio ricevuto verrà archiviato in uno stato json non elaborato, quindi potrebbe essere utilizzato, ad esempio, in script personalizzati.",
    "Allowed server roles": "Ruoli del server consentiti",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Elenco dei ruoli del server autorizzati a interagire con il bot. ",
    "Server role": "Ruolo server",
    "Here you are able to let the bot leave a discord server.": "Qui puoi lasciare che il bot lasci un server discord.",
    "The adapter instance needs to be running to let the bot leave a server!": "L'istanza dell'adattatore deve essere in esecuzione per consentire al bot di lasciare un server!",
    "Select server to leave": "Seleziona il server per uscire",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Seleziona un server da cui vuoi che il bot lasci, quindi fai clic su \"Lascia il server!\" ",
    "Leave the server!": "Lascia il server!",
    "Do you really want to let the bot leave the selected server?": "Vuoi davvero lasciare che il bot lasci il server selezionato?",
    "Yes, leave the server!": "Sì, lascia il server!",
    "Error: The Bot is not connected to Discord!": "Errore: il bot non è connesso a Discord!",
    "User ID": "ID utente",
    "Server ID": "ID server",
    "Channel ID": "Canale ID",
    "Interaction ID": "ID interazione",
    "Custom Discord slash commands": "Comandi di barra Discord personalizzati",
    "Last use timestamp": "Data e ora dell'ultimo utilizzo",
    "Option %s": "Opzioni",
    "Use custom commands": "Usa comandi personalizzati",
    "Enable custom commands": "Abilita comandi personalizzati",
    "Define custom commands which may be used for interactions with scripts for example.": "Definire comandi personalizzati che possono essere utilizzati per le interazioni con gli script, ad esempio.",
    "Custom commands": "Comandi personalizzati",
    "List of custom commands and their options.": "Elenco di comandi personalizzati e relative opzioni.",
    "Do something usefull": "Fai qualcosa di utile",
    "Command options": "Opzioni di comando",
    "String": "Corda",
    "Number": "Numero",
    "Boolean": "booleano",
    "Mentionable": "Menzionabile",
    "option-1": "opzione 1",
    "Option 1": "opzione 1",
    "Required": "Necessario",
    "Ephemeral replies": "Risposte effimere",
    "If checked, all command replies will be send as ephemeral which will make the reply only visible to the user who executed the command.": "Se selezionato, tutte le risposte ai comandi verranno inviate come effimere, il che renderà la risposta visibile solo all'utente che ha eseguito il comando."
}
