{
    "Token": "Token",
    "Your bot token from the discord developers portal": "Uw bottoken van de discord-ontwikkelaarsportal",
    "Members": "Leden",
    "Channels": "Kanalen",
    "Roles": "Rollen",
    "Display name": "Weergavenaam",
    "Joined at": "Aangesloten bij",
    "JSON data": "JSON-gegevens",
    "Member count": "Leden Aantal",
    "Last message": "Laatste bericht",
    "Last message ID": "Laatste bericht-ID",
    "Last message author": "Auteur laatste bericht",
    "Last message timestamp": "Tijdstempel van laatste bericht",
    "Last message JSON data": "Laatste bericht JSON-gegevens",
    "Send message": "Bericht versturen",
    "Send file": "Verstuur bestand",
    "Send reply": "Stuur antwoord",
    "Send reaction": "Reactie verzenden",
    "Avatar": "Avatar",
    "Bot": "Bot",
    "Status": "Toestand",
    "Activity type": "Activiteitstype",
    "Activity name": "Naam activiteit",
    "User tag": "Gebruikerstag",
    "User name": "Noem",
    "Get an ioBroker state value": "Een ioBroker-statuswaarde verkrijgen",
    "Set an ioBroker state value": "Stel een ioBroker-statuswaarde in",
    "The ioBroker state to get": "De ioBroker-status om te krijgen",
    "The ioBroker state to set": "De ioBroker-status die moet worden ingesteld",
    "The value to set": "De in te stellen waarde",
    "Unknown command!": "Onbekend commando!",
    "You are not authorized to call this command!": "U bent niet bevoegd om dit commando aan te roepen!",
    "Object `%s` not found!": "Object `%s` niet gevonden!",
    "State `%s` not found!": "Geef aan dat `%s` niet gevonden is!",
    "Object `%s` is not of type state!": "Object `%s` is niet van het type staat!",
    "true": "WAAR",
    "false": "vals",
    "not acknowledged": "niet erkend",
    "Get not allowed for state `%s`!": "Krijg niet toegestaan ​​voor status `%s`!",
    "Set not allowed for state `%s`!": "Instellen niet toegestaan ​​voor status `%s`!",
    "No value provided!": "Geen waarde opgegeven!",
    "The given value is not a number!": "De opgegeven waarde is geen getal!",
    "Value %s is below the allowed minium of %s!": "Waarde %s is lager dan het toegestane minimum van %s!",
    "Value %s is above the allowed maximum of %s!": "Waarde %s ligt boven het toegestane maximum van %s!",
    "on": "Aan",
    "off": "uit",
    "yes": "ja",
    "no": "nee",
    "Error while setting the state value!": "Fout bij het instellen van de statuswaarde!",
    "🔗 Discord Developers Portal": "🔗 Discord-ontwikkelaarsportaal",
    "Name of the bot": "Naam van de bot",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Stel een naam in voor de bot bij het starten van de adapter. ",
    "Dynamic server updates": "Dynamische serverupdates",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Kijk voor server-, kanaal- en gebruikersupdates en update objecten dienovereenkomstig. ",
    "Observe user presence": "Aanwezigheid van gebruiker observeren",
    "Observe presence status for all known users.": "Bekijk de aanwezigheidsstatus van alle bekende gebruikers.",
    "Messages": "Berichten",
    "Process all messages in server channels": "Verwerk alle berichten in serverkanalen",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Indien aangevinkt, worden alle berichten in serverkanalen door de adapter verwerkt. ",
    "React on mentions": "Reageren op vermeldingen",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Laat de adapter reageren op botvermeldingen. ",
    "React with emoji": "Reageer met emoji",
    "Emoji to react with on mentions. Default is 👍.": "Emoji om mee te reageren op vermeldingen. ",
    "text2command instance": "text2command instantie",
    "Send messages from states with enabled text2command to the given text2command instance.": "Stuur berichten van staten met ingeschakelde text2command naar de gegeven text2command-instantie.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "Adapter-instantie moet actief zijn om een ​​text2command-instantie te kunnen selecteren!",
    "Response of text2command": "Reactie van text2command",
    "How the response of text2command is send.": "Hoe het antwoord van text2command wordt verzonden.",
    "Reply": "Antwoord",
    "Message": "Bericht",
    "None": "Geen",
    "Authorization": "autorisatie",
    "Enable authorization": "Autorisatie inschakelen",
    "If checked, only authorized users will be allowed to interact with the bot.": "Indien aangevinkt, mogen alleen geautoriseerde gebruikers met de bot communiceren.",
    "Warning": "Waarschuwing",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "Wanneer autorisatie is uitgeschakeld, kan elke gebruiker met de bot communiceren! ",
    "Ignore warning": "Negeer waarschuwing",
    "Keep authorization enabled": "Autorisatie ingeschakeld houden",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "Adapterinstantie moet actief zijn om toegestane gebruikers te kunnen selecteren in een vervolgkeuzelijst! ",
    "Allowed users": "Toegestane gebruikers",
    "List of users allowed to interact with the bot.": "Lijst met gebruikers die met de bot mogen communiceren.",
    "User": "Gebruiker",
    "Get states": "Staten ophalen",
    "Set states": "Statussen instellen",
    "Use text2command": "Gebruik text2command",
    "Process messages from unauthorized users": "Verwerk berichten van onbevoegde gebruikers",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Indien aangevinkt, worden berichten van alle gebruikers verwerkt en opgeslagen in de .message-statussen, maar ze activeren geen adapteracties.",
    "Commands": "Commando's",
    "Enable commands": "Opdrachten inschakelen",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Indien aangevinkt, zal de bot discord slash-commando's registreren om ioBroker-statussen op te halen en in te stellen.",
    "Custom get state command name": "Aangepaste opdrachtnaam voor status ophalen",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Aangepaste naam voor de opdracht get state. ",
    "Custom set state command name": "Naam van aangepaste statusopdracht",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Aangepaste naam voor de opdracht set state. ",
    "Enable text2command for this state": "Schakel text2command in voor deze status",
    "When enabled, the received message is send to the configured text2command instance.": "Indien ingeschakeld, wordt het ontvangen bericht verzonden naar de geconfigureerde text2command-instantie.",
    "Enable discord commands for this state": "Schakel discord-commando's in voor deze status",
    "Make this state available for discord commands.": "Maak deze status beschikbaar voor discord-opdrachten.",
    "Name": "Naam",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Een naam voor dit object. ",
    "Alias": "Alias",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Een ID-alias voor dit object. ",
    "Allow get": "Laat krijgen",
    "Allow to get the state value by discord slash commands.": "Sta toe om de statuswaarde te krijgen door middel van discord slash-commando's.",
    "Allow set": "Instellen toestaan",
    "Allow to set the state value by discord slash commands.": "Sta toe om de statuswaarde in te stellen door middel van discord slash-commando's.",
    "Show ack=false": "Toon ack=false",
    "Show an information on get commands if the state is not acknowledged.": "Toon informatie over get-commando's als de status niet is bevestigd.",
    "Set with ack": "Instellen met ack",
    "Set a value with ack=true.": "Stel een waarde in met ack=true.",
    "True value": "Echte waarde",
    "Value to be shown if the state is true.": "Waarde die moet worden weergegeven als de status waar is.",
    "False value": "Valse waarde",
    "Value to be shown if the state is false.": "Waarde die moet worden weergegeven als de status onwaar is.",
    "Decimals": "Decimalen",
    "Decimals to round the value to.": "Decimalen om de waarde op af te ronden.",
    "Send as file": "Verzenden als bestand",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "Waarde moet worden behandeld als pad of url naar een bestand of base64-gecodeerde bestandsinhoud. ",
    "Voice channel": "Spraakkanaal",
    "Voice disconnect": "Spraakverbinding",
    "Voice self deafen": "Stem zelfdoof",
    "Voice server deafen": "Spraakserver doof",
    "Voice self mute": "Stem zelf dempen",
    "Voice server mute": "Spraakserver dempen",
    "Observe user voice state": "Observeer de stemstatus van de gebruiker",
    "Observe voice state for all known users.": "Observeer de spraakstatus van alle bekende gebruikers.",
    "Use global commands": "Algemene opdrachten gebruiken",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Indien aangevinkt, worden de slash-commando's globaal geregistreerd. ",
    "Add bot to server": "Bot toevoegen aan server",
    "Here you are able to get a link to add your bot to a discord server.": "Hier kun je een link krijgen om je bot toe te voegen aan een discord-server.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Om de link te krijgen, moet u uw bottoken in het hoofdinstellingentabblad plaatsen, de configuraties opslaan en de adapterinstantie starten/herstarten.",
    "The adapter instance needs to be running to get the link!": "De adapterinstantie moet actief zijn om de link te krijgen!",
    "Link": "Koppeling",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Kopieer de link en open deze in een nieuw browsertabblad om de bot aan een server toe te voegen.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "De volgende botmachtigingen zijn vereist door de adapter en zijn ingesloten in de bovenstaande link:",
    "Change Nickname": "Bijnaam wijzigen",
    "Read Messages/View Channels": "Berichten lezen/kanalen bekijken",
    "Moderate Members": "Leden modereren",
    "Send Messages": "Berichten sturen",
    "Embed Links": "Koppelingen insluiten",
    "Attach Files": "Voeg bestanden toe",
    "Read Message History": "Berichtgeschiedenis lezen",
    "Mention Everyone": "Noem iedereen",
    "Add Reactions": "Reacties toevoegen",
    "Mute Members": "Leden dempen",
    "Deafen Members": "Dove leden",
    "Move Members": "Leden verplaatsen",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Om een ​​overzicht te krijgen van alle statusobjecten waarvoor u opdrachten hebt ingeschakeld, klikt u op de onderstaande knop en ziet u de loguitvoer.",
    "Log state objects configured for commands": "Logstatusobjecten geconfigureerd voor opdrachten",
    "See log output": "Zie logoutput",
    "The adapter instance needs to be running to use this feature!": "De adapterinstantie moet actief zijn om deze functie te gebruiken!",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Hint: Discord-commando's moeten per staat worden ingeschakeld in de aangepaste instellingen van de staatsobjecten.",
    "Last interaction JSON data": "JSON-gegevens laatste interactie",
    "Raw data": "Ruwe data",
    "Enable raw states": "Onbewerkte toestanden inschakelen",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Indien ingeschakeld, wordt elk ontvangen bericht opgeslagen in een onbewerkte json-status, zodat het bijvoorbeeld in aangepaste scripts kan worden gebruikt.",
    "Allowed server roles": "Toegestane serverrollen",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Lijst met serverrollen die mogen communiceren met de bot. ",
    "Server role": "Serverrol",
    "Here you are able to let the bot leave a discord server.": "Hier kun je de bot een discord-server laten verlaten.",
    "The adapter instance needs to be running to let the bot leave a server!": "De adapterinstantie moet actief zijn om de bot een server te laten verlaten!",
    "Select server to leave": "Selecteer server om te vertrekken",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Selecteer een server die u wilt dat de bot verlaat en klik vervolgens op \"Verlaat de server!\" ",
    "Leave the server!": "Verlaat de server!",
    "Do you really want to let the bot leave the selected server?": "Wil je de bot echt de geselecteerde server laten verlaten?",
    "Yes, leave the server!": "Ja, verlaat de server!",
    "Error: The Bot is not connected to Discord!": "Fout: de bot is niet verbonden met Discord!",
    "User ID": "gebruikersnaam",
    "Server ID": "Server-ID",
    "Channel ID": "Kanaal Nr",
    "Interaction ID": "Interactie-ID",
    "Custom Discord slash commands": "Aangepaste Discord-slash-opdrachten",
    "Last use timestamp": "Tijdstempel van laatste gebruik",
    "Option %s": "Optie %s",
    "Use custom commands": "Gebruik aangepaste opdrachten",
    "Enable custom commands": "Aangepaste opdrachten inschakelen",
    "Define custom commands which may be used for interactions with scripts for example.": "Definieer aangepaste opdrachten die bijvoorbeeld kunnen worden gebruikt voor interacties met scripts.",
    "Custom commands": "Aangepaste opdrachten",
    "List of custom commands and their options.": "Lijst met aangepaste opdrachten en hun opties.",
    "Do something usefull": "Doe iets nuttigs",
    "Command options": "Opdrachtopties",
    "String": "Draad",
    "Number": "Nummer",
    "Boolean": "Booleaans",
    "Mentionable": "noemenswaardig",
    "option-1": "Optie 1",
    "Option 1": "Optie 1",
    "Required": "Vereist",
    "Ephemeral replies": "Kortstondige antwoorden",
    "If checked, all command replies will be send as ephemeral which will make the reply only visible to the user who executed the command.": "Indien aangevinkt, zullen alle commando-antwoorden als kortstondig worden verzonden, waardoor het antwoord alleen zichtbaar is voor de gebruiker die de opdracht heeft uitgevoerd.",
    "Option %s choices": "Optie %s keuzes",
    "Option %s value": "Optie %s waarde",
    "Hint: For string options, you may set predefined options in the corresponding 'option-*.choices' state.": "Hint: Voor string-opties kunt u vooraf gedefinieerde opties instellen in de corresponderende 'option-*.choices'-status."
}
