{
    "Token": "Símbolo",
    "Your bot token from the discord developers portal": "Seu token de bot do portal de desenvolvedores de discórdia",
    "Members": "Membros",
    "Channels": "Canais",
    "Roles": "Funções",
    "Display name": "Nome em Exibição",
    "Joined at": "Ingressou em",
    "JSON data": "Dados JSON",
    "Member count": "Contagem de membro",
    "Last message": "Última mensagem",
    "Last message ID": "Código da última mensagem",
    "Last message author": "Autor da última mensagem",
    "Last message timestamp": "Data e hora da última mensagem",
    "Last message JSON data": "Dados JSON da última mensagem",
    "Send message": "Enviar mensagem",
    "Send file": "Enviar arquivo",
    "Send reply": "Enviar resposta",
    "Send reaction": "Enviar reação",
    "Avatar": "Avatar",
    "Bot": "Robô",
    "Status": "Status",
    "Activity type": "Tipo de atividade",
    "Activity name": "Nome da atividade",
    "User tag": "Etiqueta do usuário",
    "Get an ioBroker state value": "Obter um valor de estado ioBroker",
    "Set an ioBroker state value": "Definir um valor de estado ioBroker",
    "The ioBroker state to get": "O estado do ioBroker para obter",
    "The ioBroker state to set": "O estado do ioBroker a ser definido",
    "The value to set": "O valor a definir",
    "Unknown command!": "Comando desconhecido!",
    "You are not authorized to call this command!": "Você não está autorizado a chamar este comando!",
    "Object `%s` not found!": "Objeto `%s` não encontrado!",
    "State `%s` not found!": "Estado `%s` não encontrado!",
    "Object `%s` is not of type state!": "O objeto `%s` não é do tipo state!",
    "true": "verdadeiro",
    "false": "falso",
    "not acknowledged": "não reconhecido",
    "Get not allowed for state `%s`!": "Não é permitido para o estado `%s`!",
    "Set not allowed for state `%s`!": "Conjunto não permitido para o estado `%s`!",
    "No value provided!": "Nenhum valor fornecido!",
    "The given value is not a number!": "O valor dado não é um número!",
    "Value %s is below the allowed minium of %s!": "O valor %s está abaixo do mínimo permitido de %s!",
    "Value %s is above the allowed maximum of %s!": "O valor %s está acima do máximo permitido de %s!",
    "on": "em",
    "off": "fora",
    "yes": "sim",
    "no": "não",
    "Error while setting the state value!": "Erro ao definir o valor do estado!",
    "🔗 Discord Developers Portal": "🔗 Portal de desenvolvedores do Discord",
    "Name of the bot": "Nome do bot",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Defina um nome para o bot na inicialização do adaptador. ",
    "Dynamic server updates": "Atualizações dinâmicas do servidor",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Fique atento às atualizações do servidor, canal e usuário e atualize os objetos de acordo. ",
    "Observe user presence": "Observar a presença do usuário",
    "Observe presence status for all known users.": "Observe o status de presença de todos os usuários conhecidos.",
    "Messages": "Mensagens",
    "Process all messages in server channels": "Processe todas as mensagens nos canais do servidor",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Se marcada, todas as mensagens nos canais do servidor serão processadas pelo adaptador. ",
    "React on mentions": "Reaja a menções",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Deixe o adaptador reagir às menções do bot. ",
    "React with emoji": "Reaja com emoji",
    "Emoji to react with on mentions. Default is 👍.": "Emoji para reagir com menções. ",
    "text2command instance": "instância do comando text2",
    "Send messages from states with enabled text2command to the given text2command instance.": "Envie mensagens de estados com text2command habilitado para a instância text2command fornecida.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "A instância do adaptador precisa estar em execução para poder selecionar uma instância text2command!",
    "Response of text2command": "Resposta do text2command",
    "How the response of text2command is send.": "Como a resposta do text2command é enviada.",
    "Reply": "Responder",
    "Message": "Mensagem",
    "None": "Nenhum",
    "Authorization": "Autorização",
    "Enable authorization": "Ativar autorização",
    "If checked, only authorized users will be allowed to interact with the bot.": "Se marcado, apenas usuários autorizados poderão interagir com o bot.",
    "Warning": "Aviso",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "Quando a autorização está desabilitada, qualquer usuário pode interagir com o bot! ",
    "Ignore warning": "Ignorar aviso",
    "Keep authorization enabled": "Manter a autorização ativada",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "A instância do adaptador precisa estar em execução para poder selecionar usuários permitidos em uma lista suspensa! ",
    "Allowed users": "Usuários permitidos",
    "List of users allowed to interact with the bot.": "Lista de usuários autorizados a interagir com o bot.",
    "User": "Do utilizador",
    "Get states": "Obter estados",
    "Set states": "Definir estados",
    "Use text2command": "Use o comando text2",
    "Process messages from unauthorized users": "Processar mensagens de usuários não autorizados",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Se marcada, as mensagens de todos os usuários serão processadas e armazenadas nos estados .message, mas não acionarão nenhuma ação do adaptador.",
    "Commands": "Comandos",
    "Enable commands": "Ativar comandos",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Se marcado, o bot registrará comandos de barra de discórdia para obter e definir estados do ioBroker.",
    "Custom get state command name": "Nome do comando get state personalizado",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Nome personalizado para o comando get state. ",
    "Custom set state command name": "Nome do comando de estado de conjunto personalizado",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Nome personalizado para o comando set state. ",
    "Enable text2command for this state": "Habilite o comando text2 para este estado",
    "When enabled, the received message is send to the configured text2command instance.": "Quando habilitado, a mensagem recebida é enviada para a instância text2command configurada.",
    "Enable discord commands for this state": "Ativar comandos de discórdia para este estado",
    "Make this state available for discord commands.": "Disponibilize este estado para comandos de discórdia.",
    "Name": "Nome",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Um nome para este objeto. ",
    "Alias": "Alias",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Um alias de ID para este objeto. ",
    "Allow get": "Permitir obter",
    "Allow to get the state value by discord slash commands.": "Permitir obter o valor do estado por comandos de barra de discórdia.",
    "Allow set": "Permitir conjunto",
    "Allow to set the state value by discord slash commands.": "Permitir definir o valor do estado por comandos de barra de discórdia.",
    "Show ack=false": "Mostrar confirmação = falso",
    "Show an information on get commands if the state is not acknowledged.": "Mostra uma informação sobre os comandos get se o estado não for reconhecido.",
    "Set with ack": "Definir com ack",
    "Set a value with ack=true.": "Defina um valor com ack=true.",
    "True value": "Valor real",
    "Value to be shown if the state is true.": "Valor a ser mostrado se o estado for verdadeiro.",
    "False value": "Valor falso",
    "Value to be shown if the state is false.": "Valor a ser mostrado se o estado for falso.",
    "Decimals": "Decimais",
    "Decimals to round the value to.": "Decimais para arredondar o valor.",
    "Send as file": "Enviar como arquivo",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "O valor deve ser tratado como caminho ou URL para um arquivo ou conteúdo de arquivo codificado em base64. ",
    "Voice channel": "Canal de voz",
    "Voice disconnect": "Desconexão por voz",
    "Voice self deafen": "Voz auto ensurdecedora",
    "Voice server deafen": "Servidor de voz surdo",
    "Voice self mute": "Auto mudo de voz",
    "Voice server mute": "Servidor de voz mudo",
    "Observe user voice state": "Observar o estado de voz do usuário",
    "Observe voice state for all known users.": "Observe o estado de voz de todos os usuários conhecidos.",
    "Use global commands": "Usar comandos globais",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Se marcado, os comandos de barra serão registrados globalmente. ",
    "Add bot to server": "Adicionar bot ao servidor",
    "Here you are able to get a link to add your bot to a discord server.": "Aqui você pode obter um link para adicionar seu bot a um servidor de discórdia.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Para obter o link, você precisa inserir seu token de bot na guia de configurações principal, salvar as configurações e iniciar/reiniciar a instância do adaptador.",
    "The adapter instance needs to be running to get the link!": "A instância do adaptador precisa estar em execução para obter o link!",
    "Link": "Link",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Basta copiar o link e abri-lo em uma nova guia do navegador para começar a adicionar o bot a um servidor.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "As seguintes permissões de bot são exigidas pelo adaptador e incorporadas no link acima:",
    "Change Nickname": "Alterar apelido",
    "Read Messages/View Channels": "Ler mensagens/ver canais",
    "Moderate Members": "Membros moderados",
    "Send Messages": "Enviar mensagens",
    "Embed Links": "Incorporar links",
    "Attach Files": "Anexar arquivos",
    "Read Message History": "Ler histórico de mensagens",
    "Mention Everyone": "Mencione todos",
    "Add Reactions": "Adicionar reações",
    "Mute Members": "Silenciar membros",
    "Deafen Members": "Membros surdos",
    "Move Members": "Mover membros",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Para obter uma visão geral sobre todos os objetos de estado nos quais você possui comandos habilitados, basta clicar no botão abaixo e ver a saída do log.",
    "Log state objects configured for commands": "Objetos de estado de log configurados para comandos",
    "See log output": "Ver saída de registro",
    "The adapter instance needs to be running to use this feature!": "A instância do adaptador precisa estar em execução para usar esse recurso!",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Dica: Os comandos do Discord precisam ser habilitados por estado nas configurações personalizadas dos objetos de estado.",
    "Last interaction JSON data": "Dados JSON da última interação",
    "Raw data": "Dados não tratados",
    "Enable raw states": "Ativar estados brutos",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Se ativado, qualquer mensagem recebida será armazenada em um estado json bruto, para que possa ser usada em scripts personalizados, por exemplo.",
    "Allowed server roles": "Funções de servidor permitidas",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Lista de funções de servidor com permissão para interagir com o bot. ",
    "Server role": "Função do servidor",
    "Here you are able to let the bot leave a discord server.": "Aqui você pode deixar o bot sair de um servidor de discórdia.",
    "The adapter instance needs to be running to let the bot leave a server!": "A instância do adaptador precisa estar em execução para permitir que o bot saia de um servidor!",
    "Select server to leave": "Selecione o servidor para sair",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Selecione um servidor do qual você deseja que o bot saia e clique no botão \"Sair do servidor!\" ",
    "Leave the server!": "Saia do servidor!",
    "Do you really want to let the bot leave the selected server?": "Você realmente quer deixar o bot sair do servidor selecionado?",
    "Yes, leave the server!": "Sim, saia do servidor!"
}
