{
    "Token": "Токен",
    "Your bot token from the discord developers portal": "Ваш токен бота с портала разработчиков Discord",
    "Members": "Члены",
    "Channels": "каналы",
    "Roles": "Роли",
    "Display name": "Показать имя",
    "Joined at": "Присоединился в",
    "JSON data": "JSON-данные",
    "Member count": "Количество участников",
    "Last message": "Последнее сообщение",
    "Last message ID": "Идентификатор последнего сообщения",
    "Last message author": "Автор последнего сообщения",
    "Last message timestamp": "Отметка времени последнего сообщения",
    "Last message JSON data": "Данные JSON последнего сообщения",
    "Send message": "Отправить сообщение",
    "Send file": "Отправить файл",
    "Send reply": "Отправить ответ",
    "Send reaction": "Отправить реакцию",
    "Avatar": "Аватар",
    "Bot": "Бот",
    "Status": "Положение дел",
    "Activity type": "Тип деятельности",
    "Activity name": "Название деятельности",
    "User tag": "Тег пользователя",
    "Get an ioBroker state value": "Получить значение состояния ioBroker",
    "Set an ioBroker state value": "Установите значение состояния ioBroker",
    "The ioBroker state to get": "Состояние ioBroker для получения",
    "The ioBroker state to set": "Состояние ioBroker для установки",
    "The value to set": "Значение для установки",
    "Unknown command!": "Неизвестная команда!",
    "You are not authorized to call this command!": "Вы не авторизованы для вызова этой команды!",
    "Object `%s` not found!": "Объект `%s` не найден!",
    "State `%s` not found!": "Состояние `%s` не найдено!",
    "Object `%s` is not of type state!": "Объект `%s` не имеет состояния типа!",
    "true": "истинный",
    "false": "ЛОЖЬ",
    "not acknowledged": "не подтверждено",
    "Get not allowed for state `%s`!": "Получить не разрешено для состояния `%s`!",
    "Set not allowed for state `%s`!": "Установка не разрешена для состояния `%s`!",
    "No value provided!": "Значение не указано!",
    "The given value is not a number!": "Данное значение не является числом!",
    "Value %s is below the allowed minium of %s!": "Значение %s ниже допустимого минимума %s!",
    "Value %s is above the allowed maximum of %s!": "Значение %s превышает допустимый максимум %s!",
    "on": "на",
    "off": "выключенный",
    "yes": "да",
    "no": "нет",
    "Error while setting the state value!": "Ошибка при установке значения состояния!",
    "🔗 Discord Developers Portal": "🔗 Портал разработчиков Discord",
    "Name of the bot": "Имя бота",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Задайте имя бота при запуске адаптера. ",
    "Dynamic server updates": "Динамические обновления сервера",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Следите за обновлениями сервера, канала и пользователя и обновляйте объекты соответственно. ",
    "Observe user presence": "Наблюдайте за присутствием пользователя",
    "Observe presence status for all known users.": "Наблюдайте за статусом присутствия для всех известных пользователей.",
    "Messages": "Сообщения",
    "Process all messages in server channels": "Обрабатывать все сообщения в каналах сервера",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Если флажок установлен, все сообщения в каналах сервера будут обрабатываться адаптером. ",
    "React on mentions": "Реагировать на упоминания",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Пусть адаптер реагирует на упоминания бота. ",
    "React with emoji": "Реагируйте смайликами",
    "Emoji to react with on mentions. Default is 👍.": "Emoji, чтобы реагировать на упоминания. ",
    "text2command instance": "экземпляр text2command",
    "Send messages from states with enabled text2command to the given text2command instance.": "Отправлять сообщения из состояний с включенной командой text2 в данный экземпляр text2command.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "Экземпляр адаптера должен быть запущен, чтобы можно было выбрать экземпляр text2command!",
    "Response of text2command": "Ответ text2command",
    "How the response of text2command is send.": "Как отправляется ответ text2command.",
    "Reply": "Отвечать",
    "Message": "Сообщение",
    "None": "Никто",
    "Authorization": "Авторизация",
    "Enable authorization": "Включить авторизацию",
    "If checked, only authorized users will be allowed to interact with the bot.": "Если этот флажок установлен, только авторизованные пользователи смогут взаимодействовать с ботом.",
    "Warning": "Предупреждение",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "При отключенной авторизации любой пользователь может взаимодействовать с ботом! ",
    "Ignore warning": "Игнорировать предупреждение",
    "Keep authorization enabled": "Оставить авторизацию включенной",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "Экземпляр адаптера должен быть запущен, чтобы иметь возможность выбирать разрешенных пользователей из раскрывающегося списка! ",
    "Allowed users": "Разрешенные пользователи",
    "List of users allowed to interact with the bot.": "Список пользователей, которым разрешено взаимодействовать с ботом.",
    "User": "Пользователь",
    "Get states": "Получить состояния",
    "Set states": "Установить состояния",
    "Use text2command": "Используйте команду text2",
    "Process messages from unauthorized users": "Обрабатывать сообщения от неавторизованных пользователей",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Если флажок установлен, сообщения от всех пользователей будут обрабатываться и сохраняться в состояниях .message, но они не будут запускать какие-либо действия адаптера.",
    "Commands": "Команды",
    "Enable commands": "Включить команды",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Если флажок установлен, бот будет регистрировать слэш-команды разногласий для получения и установки состояний ioBroker.",
    "Custom get state command name": "Пользовательское имя команды получения состояния",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Пользовательское имя для команды получения состояния. ",
    "Custom set state command name": "Имя команды пользовательского набора состояний",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Пользовательское имя для команды установки состояния. ",
    "Enable text2command for this state": "Включить text2command для этого состояния",
    "When enabled, the received message is send to the configured text2command instance.": "Если этот параметр включен, полученное сообщение отправляется настроенному экземпляру text2command.",
    "Enable discord commands for this state": "Включить команды раздора для этого состояния",
    "Make this state available for discord commands.": "Сделайте это состояние доступным для команд разногласий.",
    "Name": "Имя",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Имя для этого объекта. ",
    "Alias": "Псевдоним",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Псевдоним идентификатора для этого объекта. ",
    "Allow get": "Разрешить получить",
    "Allow to get the state value by discord slash commands.": "Разрешить получать значение состояния с помощью команд discord slash.",
    "Allow set": "Разрешить установку",
    "Allow to set the state value by discord slash commands.": "Разрешить устанавливать значение состояния с помощью команд косой черты разногласий.",
    "Show ack=false": "Показать подтверждение = ложь",
    "Show an information on get commands if the state is not acknowledged.": "Показать информацию о командах get, если состояние не подтверждено.",
    "Set with ack": "Установить с акком",
    "Set a value with ack=true.": "Установите значение с ack=true.",
    "True value": "Истинное значение",
    "Value to be shown if the state is true.": "Значение, которое будет показано, если состояние истинно.",
    "False value": "Ложное значение",
    "Value to be shown if the state is false.": "Значение, которое будет показано, если состояние ложно.",
    "Decimals": "Десятичные",
    "Decimals to round the value to.": "Десятичные числа, до которых округляется значение.",
    "Send as file": "Отправить как файл",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "Значение следует рассматривать как путь или URL-адрес к файлу или содержимому файла в кодировке base64. ",
    "Voice channel": "Голосовой канал",
    "Voice disconnect": "Голосовое отключение",
    "Voice self deafen": "Голос самооглушается",
    "Voice server deafen": "Голосовой сервер оглушить",
    "Voice self mute": "Самоотключение голоса",
    "Voice server mute": "Голосовой сервер отключен",
    "Observe user voice state": "Наблюдайте за состоянием голоса пользователя",
    "Observe voice state for all known users.": "Наблюдайте за состоянием голоса всех известных пользователей.",
    "Use global commands": "Используйте глобальные команды",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Если этот флажок установлен, слэш-команды будут зарегистрированы глобально. ",
    "Add bot to server": "Добавить бота на сервер",
    "Here you are able to get a link to add your bot to a discord server.": "Здесь вы можете получить ссылку для добавления вашего бота на сервер разногласий.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Чтобы получить ссылку, вам нужно вставить токен вашего бота в основную вкладку настроек, сохранить настройки и запустить/перезапустить экземпляр адаптера.",
    "The adapter instance needs to be running to get the link!": "Экземпляр адаптера должен быть запущен, чтобы получить ссылку!",
    "Link": "Связь",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Просто скопируйте ссылку и откройте ее в новой вкладке браузера, чтобы начать добавлять бота на сервер.",
    "The following bot permissions are required by the adapter and embedded into the link above:": "Следующие разрешения бота требуются адаптеру и встроены в приведенную выше ссылку:",
    "Change Nickname": "Изменить псевдоним",
    "Read Messages/View Channels": "Чтение сообщений/просмотр каналов",
    "Moderate Members": "Умеренные участники",
    "Send Messages": "Отправить сообщения",
    "Embed Links": "Вставить ссылки",
    "Attach Files": "Прикрепить файлы",
    "Read Message History": "Читать историю сообщений",
    "Mention Everyone": "Упоминание всех",
    "Add Reactions": "Добавить реакции",
    "Mute Members": "Заглушить участников",
    "Deafen Members": "Оглушить участников",
    "Move Members": "Переместить участников",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Чтобы получить обзор всех объектов состояния, для которых у вас включены команды, просто нажмите кнопку ниже и просмотрите вывод журнала.",
    "Log state objects configured for commands": "Объекты состояния журнала, настроенные для команд",
    "See log output": "См. вывод журнала",
    "The adapter instance needs to be running to use this feature!": "Экземпляр адаптера должен быть запущен, чтобы использовать эту функцию!",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Подсказка: команды Discord должны быть включены для каждого состояния в пользовательских настройках объектов состояния.",
    "Last interaction JSON data": "Данные JSON о последнем взаимодействии",
    "Raw data": "Необработанные данные",
    "Enable raw states": "Включить необработанные состояния",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Если включено, любое полученное сообщение будет сохранено в необработанном состоянии json, поэтому его можно будет использовать, например, в пользовательских сценариях.",
    "Allowed server roles": "Разрешенные роли сервера",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Список ролей сервера, которым разрешено взаимодействовать с ботом. ",
    "Server role": "Роль сервера",
    "Here you are able to let the bot leave a discord server.": "Здесь вы можете позволить боту покинуть дискорд-сервер.",
    "The adapter instance needs to be running to let the bot leave a server!": "Экземпляр адаптера должен быть запущен, чтобы бот мог покинуть сервер!",
    "Select server to leave": "Выберите сервер, чтобы покинуть",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Выберите сервер, который вы хотите, чтобы бот покинул, а затем нажмите «Покинуть сервер!» ",
    "Leave the server!": "Покиньте сервер!",
    "Do you really want to let the bot leave the selected server?": "Вы действительно хотите, чтобы бот покинул выбранный сервер?",
    "Yes, leave the server!": "Да, покиньте сервер!",
    "Error: The Bot is not connected to Discord!": "Ошибка: Бот не подключен к Discord!",
    "User ID": "Логин пользователя",
    "Server ID": "Идентификатор сервера",
    "Channel ID": "Идентификатор канала",
    "Interaction ID": "Идентификатор взаимодействия",
    "Custom Discord slash commands": "Пользовательские слэш-команды Discord",
    "Last use timestamp": "Отметка времени последнего использования",
    "Option %s": "Опции",
    "Use custom commands": "Используйте пользовательские команды",
    "Enable custom commands": "Включить пользовательские команды",
    "Define custom commands which may be used for interactions with scripts for example.": "Определите пользовательские команды, которые можно использовать, например, для взаимодействия со сценариями.",
    "Custom commands": "Пользовательские команды",
    "List of custom commands and their options.": "Список пользовательских команд и их параметров.",
    "Do something usefull": "Сделай что-нибудь полезное",
    "Command options": "Параметры команды",
    "String": "Нить",
    "Number": "Количество",
    "Boolean": "логический",
    "Mentionable": "Упоминания",
    "option-1": "Опция 1",
    "Option 1": "Опция 1",
    "Required": "Необходимый"
}
