{
    "Members": "Члени",
    "Channels": "Канали",
    "Roles": "Ролі",
    "User ID": "ідентифікатор користувача",
    "Server ID": "ID сервера",
    "Channel ID": "ID каналу",
    "Interaction ID": "ID взаємодії",
    "User tag": "Тег користувача",
    "User name": "Ім'я користувача",
    "Display name": "Відображуване ім'я",
    "Joined at": "Приєднався до",
    "JSON data": "дані JSON",
    "Member count": "Кількість учасників",
    "Last message": "Останнє повідомлення",
    "Last message ID": "ID останнього повідомлення",
    "Last message author": "Автор останнього повідомлення",
    "Last message timestamp": "Мітка часу останнього повідомлення",
    "Last message JSON data": "Дані JSON останнього повідомлення",
    "Last interaction JSON data": "Дані JSON останньої взаємодії",
    "Custom Discord slash commands": "Спеціальні команди Discord зі слешами",
    "Send message": "Відправити повідомлення",
    "Send file": "Надіслати файл",
    "Send reply": "Надіслати відповідь",
    "Send reaction": "Надіслати реакцію",
    "Avatar": "Аватар",
    "Bot": "Бот",
    "Status": "Статус",
    "Activity type": "Вид діяльності",
    "Activity name": "Назва діяльності",
    "Voice channel": "Голосовий канал",
    "Voice disconnect": "Відключення голосу",
    "Voice self deafen": "Голос самооглушається",
    "Voice server deafen": "Голосовий сервер глухий",
    "Voice self mute": "Самовідключення голосу",
    "Voice server mute": "Голосовий сервер вимкнено",
    "Raw data": "Необроблені дані",
    "Last use timestamp": "Мітка часу останнього використання",
    "Option %s": "Опція %s",
    "Option %s value": "Значення опції %s",
    "Option %s choices": "Варіант %s вибір",
    "Get an ioBroker state value": "Отримайте значення стану ioBroker",
    "Set an ioBroker state value": "Встановіть значення стану ioBroker",
    "The ioBroker state to get": "Стан ioBroker, який потрібно отримати",
    "The ioBroker state to set": "Стан ioBroker, який потрібно встановити",
    "The value to set": "Значення, яке потрібно встановити",
    "Unknown command!": "Невідома команда!",
    "You are not authorized to call this command!": "Ви не маєте права викликати цю команду!",
    "Object `%s` not found!": "Об'єкт `%s` не знайдено!",
    "State `%s` not found!": "Стан `%s` не знайдено!",
    "Object `%s` is not of type state!": "Об’єкт `%s` не має стану типу!",
    "true": "правда",
    "false": "помилковий",
    "not acknowledged": "не визнано",
    "Get not allowed for state `%s`!": "Отримайте заборону для стану `%s`!",
    "Set not allowed for state `%s`!": "Встановлення заборонено для стану `%s`!",
    "No value provided!": "Значення не надано!",
    "The given value is not a number!": "Дане значення не є числом!",
    "Value %s is below the allowed minium of %s!": "Значення %s нижче дозволеного мінімуму %s!",
    "Value %s is above the allowed maximum of %s!": "Значення %s перевищує допустимий максимум %s!",
    "on": "на",
    "off": "вимкнено",
    "yes": "так",
    "no": "немає",
    "Error while setting the state value!": "Помилка під час встановлення значення стану!",
    "Token": "Токен",
    "Your bot token from the discord developers portal": "Ваш маркер бота з порталу розробників Discord",
    "🔗 Discord Developers Portal": "🔗 Портал розробників Discord",
    "Name of the bot": "Назва бота",
    "Set a name for the bot on adapter start. Leave empty to keep current bot name.": "Встановіть назву для бота під час запуску адаптера. Залиште поле пустим, щоб зберегти поточне ім’я бота.",
    "Dynamic server updates": "Динамічні оновлення сервера",
    "Watch for server, channel and user updates and update objects according. If disabled, the objects will only be updated on adapter start.": "Слідкуйте за оновленнями сервера, каналу та користувачів і відповідно оновлюйте об’єкти. Якщо вимкнено, об’єкти оновлюватимуться лише під час запуску адаптера.",
    "Observe user presence": "Слідкуйте за присутністю користувача",
    "Observe presence status for all known users.": "Спостерігайте за станом присутності всіх відомих користувачів.",
    "Observe user voice state": "Спостерігайте за станом голосу користувача",
    "Observe voice state for all known users.": "Спостерігайте за станом голосу всіх відомих користувачів.",
    "Enable raw states": "Увімкнути необроблені стани",
    "If enabled, any received message will be stored to a raw json state, so it could be used in custom scripts for example.": "Якщо ввімкнути, будь-яке отримане повідомлення зберігатиметься в необробленому стані json, тому його можна буде використовувати, наприклад, у спеціальних сценаріях.",
    "Messages": "Повідомлення",
    "Process all messages in server channels": "Обробляти всі повідомлення в каналах сервера",
    "If checked, all messages in server channels will be processed by the adapter. Otherwise only mentions and commands will be processed.": "Якщо позначено, усі повідомлення в каналах сервера оброблятимуться адаптером. Інакше оброблятимуться лише згадки та команди.",
    "React on mentions": "Реагуйте на згадки",
    "Let the adapter react on bot mentions. If authorization is enabled, this only works for authorized users.": "Нехай адаптер реагує на згадки бота. Якщо авторизацію ввімкнено, це працює лише для авторизованих користувачів.",
    "React with emoji": "Реагуйте за допомогою емодзі",
    "Emoji to react with on mentions. Default is 👍.": "Емодзі, якими можна реагувати на згадування. За замовчуванням 👍.",
    "text2command instance": "примірник text2command",
    "Send messages from states with enabled text2command to the given text2command instance.": "Надсилати повідомлення зі станів із увімкненою командою text2command до вказаного екземпляра text2command.",
    "Adapter instance needs to be running to be able to select a text2command instance!": "Екземпляр адаптера повинен бути запущений, щоб мати можливість вибрати екземпляр text2command!",
    "Response of text2command": "Відповідь text2command",
    "How the response of text2command is send.": "Як надсилається відповідь text2command.",
    "Reply": "Відповісти",
    "Message": "повідомлення",
    "None": "Жодного",
    "Authorization": "Авторизація",
    "Enable authorization": "Увімкнути авторизацію",
    "If checked, only authorized users will be allowed to interact with the bot.": "Якщо позначено, лише авторизовані користувачі зможуть взаємодіяти з ботом.",
    "Warning": "УВАГА",
    "When authorization is disabled, any user is able to interact with the bot! You should only disable authorization if you trust all users on any server where the bot is on. Do you really want to disable authorization?": "При вимкненій авторизації будь-який користувач може взаємодіяти з ботом! Вимкніть авторизацію, лише якщо ви довіряєте всім користувачам будь-якого сервера, де працює бот. Ви дійсно хочете відключити авторизацію?",
    "Ignore warning": "Ігнорувати попередження",
    "Keep authorization enabled": "Залиште авторизацію ввімкненою",
    "Adapter instance needs to be running to be able to select allowed users from a drop down list! Otherwise you need to enter the user IDs manually.": "Екземпляр адаптера повинен бути запущений, щоб мати можливість вибирати дозволених користувачів зі спадного списку! В іншому випадку вам потрібно ввести ідентифікатори користувачів вручну.",
    "Allowed users": "Дозволені користувачі",
    "List of users allowed to interact with the bot.": "Список користувачів, яким дозволено взаємодіяти з ботом.",
    "Allowed server roles": "Дозволені ролі сервера",
    "List of server roles allowed to interact with the bot. These are server specific and only apply to server channels.": "Список ролей сервера, яким дозволено взаємодіяти з ботом. Вони стосуються окремих серверів і застосовуються лише до каналів сервера.",
    "User": "Користувач",
    "Server role": "Роль сервера",
    "Get states": "Отримати штати",
    "Set states": "Встановити стани",
    "Use custom commands": "Використовуйте власні команди",
    "Use text2command": "Використовуйте команду text2",
    "Process messages from unauthorized users": "Обробляти повідомлення від неавторизованих користувачів",
    "If checked, messages from all users will be processed and stored into the .message states, but they will not trigger any adapter actions.": "Якщо позначено, повідомлення від усіх користувачів оброблятимуться та зберігатимуться в стані .message, але вони не запускатимуть жодних дій адаптера.",
    "Commands": "Команди",
    "Enable commands": "Увімкнути команди",
    "If checked, the bot will register discord slash commands to get and set ioBroker states.": "Якщо позначено, бот реєструватиме команди розбіжності, щоб отримати та встановити стани ioBroker.",
    "Use global commands": "Використовуйте глобальні команди",
    "If checked, the slash commands will be registered globally. This will make commands available in direct messages, but command changes may take up to one hour to apply.": "Якщо позначено, команди скісної риски реєструватимуться глобально. Це зробить команди доступними в прямих повідомленнях, але для застосування змін команди може знадобитися до однієї години.",
    "Ephemeral replies": "Ефемерні відповіді",
    "If checked, all command replies will be send as ephemeral which will make the reply only visible to the user who executed the command.": "Якщо позначено, усі відповіді на команди надсилатимуться як ефемерні, що зробить відповідь видимою лише для користувача, який виконав команду.",
    "Custom get state command name": "Спеціальна назва команди отримання стану",
    "Custom name for the get state command. Defaults to 'iob-get'.": "Власне ім'я для команди отримання стану. За замовчуванням \"iob-get\".",
    "Custom set state command name": "Ім'я команди стану спеціального налаштування",
    "Custom name for the set state command. Defaults to 'iob-get'.": "Власне ім'я для команди встановлення стану. За замовчуванням \"iob-get\".",
    "Hint: Discord commands needs to enabled per state in the custom settings of the state objects.": "Підказка: команди Discord потрібно ввімкнути для кожного стану в спеціальних налаштуваннях об’єктів стану.",
    "To get an overview about all state objects where you have commands enabled, just click the button below and see the log output.": "Щоб отримати огляд усіх об’єктів стану, для яких увімкнено команди, просто натисніть кнопку нижче та перегляньте вихідні дані журналу.",
    "Log state objects configured for commands": "Об’єкти стану журналу, налаштовані для команд",
    "See log output": "Перегляньте вихід журналу",
    "The adapter instance needs to be running to use this feature!": "Для використання цієї функції екземпляр адаптера має бути запущено!",
    "Enable custom commands": "Увімкнути спеціальні команди",
    "Define custom commands which may be used for interactions with scripts for example.": "Визначте власні команди, які можна використовувати, наприклад, для взаємодії зі сценаріями.",
    "Custom commands": "Спеціальні команди",
    "List of custom commands and their options.": "Список користувальницьких команд і їх опцій.",
    "Do something usefull": "Зробіть щось корисне",
    "Command options": "Параметри команди",
    "String": "Рядок",
    "Number": "Номер",
    "Boolean": "Логічний",
    "Mentionable": "Варто згадати",
    "option-1": "варіант-1",
    "Option 1": "Варіант 1",
    "Required": "вимагається",
    "Hint: For string options, you may set predefined options in the corresponding 'option-*.choices' state.": "Підказка: для параметрів рядка ви можете встановити попередньо визначені параметри у відповідному стані 'option-*.choices'.",
    "Add bot to server": "Додати бота на сервер",
    "Here you are able to get a link to add your bot to a discord server.": "Тут ви можете отримати посилання, щоб додати свого бота на сервер Discord.",
    "To get the link, you need to insert your bot token in the main settings tab, save the configurations and start/restart the adapter instance.": "Щоб отримати посилання, вам потрібно вставити токен свого бота в головну вкладку налаштувань, зберегти конфігурації та запустити/перезапустити екземпляр адаптера.",
    "The adapter instance needs to be running to get the link!": "Екземпляр адаптера повинен бути запущений, щоб отримати посилання!",
    "Link": "Посилання",
    "Just copy the link and open it in a new browser tab to start adding the bot to a server.": "Просто скопіюйте посилання та відкрийте його в новій вкладці браузера, щоб почати додавати бота на сервер.",
    "Error: The Bot is not connected to Discord!": "Помилка: бот не підключений до Discord!",
    "The following bot permissions are required by the adapter and embedded into the link above:": "Наступні дозволи бота вимагаються для адаптера та вбудовані в посилання вище:",
    "Change Nickname": "Змінити псевдонім",
    "Read Messages/View Channels": "Читання повідомлень/перегляд каналів",
    "Moderate Members": "Помірковані члени",
    "Send Messages": "Надсилати повідомлення",
    "Embed Links": "Вставити посилання",
    "Attach Files": "Прикріпити файли",
    "Read Message History": "Читати історію повідомлень",
    "Mention Everyone": "Згадайте всіх",
    "Add Reactions": "Додайте реакції",
    "Mute Members": "Вимкнути звук учасників",
    "Deafen Members": "Deafen Members",
    "Move Members": "Перемістити учасників",
    "Here you are able to let the bot leave a discord server.": "Тут ви можете дозволити боту покинути сервер Discord.",
    "The adapter instance needs to be running to let the bot leave a server!": "Примірник адаптера повинен бути запущений, щоб дозволити боту залишити сервер!",
    "Select server to leave": "Виберіть сервер для виходу",
    "Select a server you want the bot to leave and then click the \"Leave the server!\" button.": "Виберіть сервер, який бот має залишити, а потім натисніть «Залишити сервер!» кнопку.",
    "Leave the server!": "Залиште сервер!",
    "Do you really want to let the bot leave the selected server?": "Ви дійсно хочете дозволити боту залишити вибраний сервер?",
    "Yes, leave the server!": "Так, залишити сервер!",
    "Enable text2command for this state": "Увімкнути команду text2 для цього стану",
    "When enabled, the received message is send to the configured text2command instance.": "Якщо ввімкнено, отримане повідомлення надсилається до налаштованого екземпляра text2command.",
    "Enable discord commands for this state": "Увімкнути команди Discord для цього стану",
    "Make this state available for discord commands.": "Зробити цей стан доступним для команд discord.",
    "Name": "Ім'я",
    "A name for this object. Leave empty to use the object name. Must not exceed 100 chars.": "Назва цього об'єкта. Залиште порожнім, щоб використовувати назву об’єкта. Не має перевищувати 100 символів.",
    "Alias": "Псевдонім",
    "An ID alias for this object. Leave empty to use the object ID. Must not exceed 100 chars.": "Псевдонім ідентифікатора цього об’єкта. Залиште пустим, щоб використовувати ідентифікатор об’єкта. Не має перевищувати 100 символів.",
    "Allow get": "Дозволити отримати",
    "Allow to get the state value by discord slash commands.": "Дозволяє отримати значення стану за допомогою команд розбіжності.",
    "Allow set": "Дозволити встановити",
    "Allow to set the state value by discord slash commands.": "Дозволяє встановлювати значення стану за допомогою команд discord slash.",
    "Show ack=false": "Показати ack=false",
    "Show an information on get commands if the state is not acknowledged.": "Показувати інформацію про команди отримання, якщо стан не підтверджено.",
    "Set with ack": "Комплект з підтвердженням",
    "Set a value with ack=true.": "Встановіть значення за допомогою ack=true.",
    "True value": "Справжня цінність",
    "Value to be shown if the state is true.": "Значення, яке буде показано, якщо стан є істинним.",
    "False value": "Помилкове значення",
    "Value to be shown if the state is false.": "Значення, яке буде показано, якщо стан false.",
    "Decimals": "Десяткові дроби",
    "Decimals to round the value to.": "Десяткові знаки, до яких потрібно округлити значення.",
    "Send as file": "Надіслати як файл",
    "Value should be treated as path or url to a file or base64 encoded file content. The file will be send as an attachment.": "Значення слід розглядати як шлях або URL-адресу до файлу або вмісту файлу в кодуванні base64. Файл буде надіслано як вкладення."
}
